{
    "results": [
        {
            "id": 1,
            "hero_name": "Akai",
            "image": "/images/Akai.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "115",
                "magic_power": "0",
                "armor": "24",
                "magic_resistance": "10",
                "hp": "2769",
                "mana": "422",
                "attack_speed": "0.85",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Tai Chi",
                    "ability_type": "Passive",
                    "ability_desc": "After using a skill, Akai will gain a shield that absorbs up to 6% of his Max HP. Lasts 2s. The effect activates every 2.5s."
                },
                {
                    "ability_name": "Thousand Pounder",
                    "ability_type": "Active",
                    "ability_desc": "Akai jumps towards a designated location. Upon landing, he deals 300 (+50% Total Physical ATK) points of Physical Damage to enemy units, and slows them for 30% for 2s. When Akai deals damage to enemies marked with Blender, they will get stunned for extra 1s."
                },
                {
                    "ability_name": "Hurricane Dance",
                    "ability_type": "Active",
                    "ability_desc": "Akai spins like a tornado for 3.5s and knocks back the surrounding enemies, dealing 180 (+100% Total Physical ATK) points of Physical Damage (Damage decays against the same target).\n\nUsing this skill removes all debuffs from Akai immediately. He also becomes immune to Slowing Effect in the duration and increases 30 points of his Movement Speed."
                },
                {
                    "ability_name": "Blender",
                    "ability_type": "Active",
                    "ability_desc": "Akai fires a frog-shaped wave in the designated direction. The wave explodes upon hitting enemies or once it reaches its Max range, dealing 350 (+120% Total Physical ATK) points of Physical Damage to enemies and marking them for 5s.\n\nAkai's Basic Attack on marked targets deal extra 5% Physical Damage of Akai's Max HP."
                }
            ]
        },
        {
            "id": 2,
            "hero_name": "Aldous",
            "image": "/images/Aldous.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "129",
                "physical_defense": "22",
                "magic_power": "0",
                "armor": "22",
                "magic_resistance": "10",
                "hp": "2718",
                "mana": "405",
                "attack_speed": "0.84",
                "hp_regen_rate": "45",
                "mana_regen_rate": "18",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Contract: Transform",
                    "ability_type": "Passive",
                    "ability_desc": "After every 2 attacks, the 100% damage dealt by Aldous's next Basic attack will be transformed into a shield that lasts for 3s.\nThe shield effect activates every 5s."
                },
                {
                    "ability_name": "Contract: Chase Fate",
                    "ability_type": "Active",
                    "ability_desc": "Aldous gets vision of all enemies for 5s. During this, if Aldous uses this skill for a second time, he can dash toward an enemy hero. When Aldous hits that enemy hero, he will deal Physical Damage equal to 400 (+100% Total Physical ATK) plus 10% of the target's Max HP and knock enemy back for 1s."
                },
                {
                    "ability_name": "Contract: Soul Steal",
                    "ability_type": "Active",
                    "ability_desc": "Aldous unleashes his inner energy to strengthen his Basic Attack, dealing 100 (+100% Total Physical ATK) points of Physical Damage. If this attack eliminates an enemy hero or a non-hero unit, Aldous will gain 10/2 stacks of Soul Steal. Each stack increases the damage of this kill by 8 points permanently.\nWhen attacking Minions or Creeps, the damage of a strengthened Basic Attack is increased by 300%. Aldous gets extra 1 stack(s) from Soul Steal when enemy non-hero units die in a range."
                },
                {
                    "ability_name": "Contract: Explosion",
                    "ability_type": "Active",
                    "ability_desc": "Aldous assumes a defensive stance and ingores all Basic Attacks, reducing 50% damage that he takes. Lasts 2s. When canceling the defensive stance manually or the stance ends, he deals 100 (+20% Total Physical ATK) to 200 (+40% Total Physical ATK) points of Physical Damage to nearby enemy units and stuns them for 0.5s-1s. The stun time is affected by the duration of the defensive stance."
                }
            ]
        },
        {
            "id": 3,
            "hero_name": "Alice",
            "image": "/images/Alice.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "diamond_cost": "399",
                "movement_speed": "240",
                "physical_attack": "114",
                "physical_defense": "21",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2573",
                "mana": "493",
                "attack_speed": "0.8",
                "hp_regen_rate": "36",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Blood Ancestry",
                    "ability_type": "Passive",
                    "ability_desc": "When a nearby Minion dies, it generates a blood orb. Each blood orb alice absorbs will permanently increase her Max HP by 10. AFter absorbing 12/25/50 blood orbs, she will receive permanently 10% CD Reduction/10% Magic Lifesteal/40 Movement Speed."
                },
                {
                    "ability_name": "Blood Awe",
                    "ability_type": "Active",
                    "ability_desc": "Alice deals 270 (+90% Total Magic Power) points of Magic Damage to nearby enemies, immobilizing them for 1.2s. Enemies will be slowed by 70% after the immobilization. Lasts 0.8s."
                },
                {
                    "ability_name": "Blood Ode",
                    "ability_type": "Active",
                    "ability_desc": "Alice enters the blood-sucking state for 5s, dealing 160 (+70% Total Magic Power) points of Magic Damage to surrounding enemies every 0.5s while restoring 80(+30% Total Magic Power) HP for herself. If the target is a non-hero unit, she restores 50% of HP."
                },
                {
                    "ability_name": "Flowing Blood",
                    "ability_type": "Active",
                    "ability_desc": "Alice casts Blood Stream in the designated direction, dealing 350 (+180% Total Magic Power) points of Magic Damage to enemies.\n\nUsing this skill again to immediately teleport to the Stream's location."
                }
            ]
        },
        {
            "id": 4,
            "hero_name": "Alpha",
            "image": "/images/Alpha.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "121",
                "physical_defense": "20",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2646",
                "mana": "453",
                "attack_speed": "0.92",
                "hp_regen_rate": "39",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Rotary Impact",
                    "ability_type": "Active",
                    "ability_desc": "Alpha launches a slash forward, dealing 210 (+90% Total Physical ATK) points of Physical Damage to enemies along the way and slowing them by 40% for 2s.\nAfter the light wave is launched, Beta will follow its trace to strafe enemies, dealing 90 (+90% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Force Swing",
                    "ability_type": "Active",
                    "ability_desc": "After charging for a while, Alpha strikes forward in a fan-shaped area and deals 160 (+170% Total Physical ATK) points of Physical Damage to enemies and slow them. Each hit increases his Attack Speed by 5% and restores 150(+40% Total Magic Power) HP.\nWhen cahrging phase ends, Beta will strafe enemies within attack range, dealing 40 (+30% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Spear of Alpha",
                    "ability_type": "Active",
                    "ability_desc": "Alpha wields the light spear powerfully, stunning enemies for 1.3s and pulling himself to them, dealing 245 (+140% Total Physical ATK) points of Physical Damage along the way. \nWhen the light spear hits enemies, it will guide Beta to strafe toward the target area, dealing 205 (+80% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Beta, Advance!",
                    "ability_type": "Passive",
                    "ability_desc": "Alpha summons Beta to attack and mark a target. Beta will attack the target continuously after 2 marks, dealing 150 (+180% Total Physical ATK) points of True Damage in total."
                }
            ]
        },
        {
            "id": 5,
            "hero_name": "Alucard",
            "image": "/images/Alucard.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "movement_speed": "260",
                "physical_attack": "123",
                "magic_power": "0",
                "armor": "21",
                "magic_resistance": "10",
                "hp": "2821",
                "mana": "0",
                "attack_speed": "0.9",
                "hp_regen_rate": "39",
                "mana_regen_rate": "0",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Fission Wave",
                    "ability_type": "Active",
                    "ability_desc": "Alucard increases his Physical Lifesteal by 20% and locks onto an enemy. Meanwhile, his Lifesteal Effect increases by 100%. Lasts 8s. During the time, he can fire a powerful attack wave forward, dealing 440 (+220% Total Physical ATK) points of Physical Damage to enemies."
                },
                {
                    "ability_name": "Groundsplitter",
                    "ability_type": "Active",
                    "ability_desc": "Alucard jumps to a designated location and leaps forward to launch strikes, dealing 240 (+160% Total Physical ATK) points of Physical Damage and slowing enemies by 40% for 2s."
                },
                {
                    "ability_name": "Pursuit",
                    "ability_type": "Passive",
                    "ability_desc": "If Alucard's skill hits only 1 enemy, it deals 1.2 damage. If it hits 2 enemies, it deals 1.1 damage. Alucard's next Basic Attack after using any skill deals 1.2x damge and takes him to his target."
                },
                {
                    "ability_name": "Whirling Smash",
                    "ability_type": "Active",
                    "ability_desc": "Alucard slashes at nearby enemies, dealing 230 (+140% Total Physical ATK) points of Physical Damage."
                }
            ]
        },
        {
            "id": 6,
            "hero_name": "Angela",
            "image": "/images/Angela.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "124",
                "physical_defense": "21",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2628",
                "mana": "0",
                "attack_speed": "0.92",
                "hp_regen_rate": "40",
                "mana_regen_rate": "0",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Love Waves",
                    "ability_type": "Active",
                    "ability_desc": "Angela releases Love Energy in the targeted direction, dealing 170 (+50 % Total Magic Power) points of Magic Damage and adding Lover's Mark to enemies. Each stack of Lover's Mark increases the amount of damage the target takes by 20%, and slows them by 18%. Lasts 3s, and can be stacked up to 5 times. Restores 100 (+60% Total Magic Power) points of HP to allies of allies are hit. Up to 5 charges can be stored (recharge time is affected by CD Reduction)."
                },
                {
                    "ability_name": "Heartguard",
                    "ability_type": "Active",
                    "ability_desc": "Angela generates a shield for any chosen ally on the map, absorbing their damage taken up to 1200 (+200% Total Magic Power) points. The shield lasts 6s. After a while, Angela will be attached to the ally for 12s. Dujring the Attached State, Angel can use all her skills without costing Maana. Once this skill is used again or the ally is dead, Angela will be withdrawn from the ally."
                },
                {
                    "ability_name": "Puppet-on-a-String",
                    "ability_type": "Active",
                    "ability_desc": "Angela releases a puppet string to the chosen target, dealing 300 (+40% Total Magic Power) points of Magic Damage and gradually slowing the target by up to 80%. If the target is still connected to the string after 3s, they will be immobolized for 1.5s and take 450 (+60% Total Magic Power) points of Magic Damage. Each stack of Lover's Mark increases the Final Damage by 20%."
                },
                {
                    "ability_name": "Smart Heart",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Angela uses a skill, her Movement Speed increases by 15% for 4s, up to 30%. The attached ally also enjoys the Movement Bonus."
                }
            ]
        },
        {
            "id": 7,
            "hero_name": "Argus",
            "image": "/images/Argus.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "124",
                "physical_defense": "21",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2628",
                "attack_speed": "0.92",
                "hp_regen_rate": "40",
                "mana_regen_rate": "0",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Eternal Evil",
                    "ability_type": "Active",
                    "ability_desc": "Argus transforms into a fallen angel, clearing all his debuffs. Meanwhile, he recharges his blade once and becomes immune to death for 5s. The time he's controlled is decreased by 25%. 100% of the damage dealt during the skill's duration will be converted to Argus's HP after the skill ends."
                },
                {
                    "ability_name": "Warmonger",
                    "ability_type": "Passive",
                    "ability_desc": "When Argus takes or deals damage, the blade is empowered. The lower Argus's HP is, the faster his blade charges. When fully charged, his next Basic Attack hits twice rapidly and slightly slash towards enemies."
                },
                {
                    "ability_name": "Meteoric Sword",
                    "ability_type": "Active",
                    "ability_desc": "After a short period of charging, Argus strikes enemies with his demonic blade, dealing 450 (+130% Total Magic Power) points of Magic Damage and slowing them for 80%. Lasts 0.8s. The demonic blade curses the injured enemy for 5s. Enemy under curse leaves a curse trail that grants Argus extra Movement Speed while he is moving on it."
                },
                {
                    "ability_name": "Demonic Grip",
                    "ability_type": "Active",
                    "ability_desc": "Argus puts out a demonic hand at the designated direction, dealing 125 (+60% Total Magic Power) points of Magic Damage to an enemy hero and moving to the front of the target. If this skill fails to hit an enemy hero, he will pull himself to the location.\n\nUse Again: If this kill hits a target, Argus makes an extra slash towards the enemy that he captures, dealing 175 (+100% Total Magic Power) points of Magic Damage."
                }
            ]
        },
        {
            "id": 8,
            "hero_name": "Aurora",
            "image": "/images/Aurora.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "245",
                "physical_attack": "105",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2441",
                "mana": "500",
                "attack_speed": "1",
                "hp_regen_rate": "34",
                "mana_regen_rate": "23",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Pride of Ice",
                    "ability_type": "Passive",
                    "ability_desc": "Each time her skill is cast, one unit of frost energy will be added to Aurora. When 4 units of frost energy is collected, the next damage of Frozen freezes the target. Lasts 1.5s.\n\nAll skills can deal extra 30% Magic Damage to the targets with Frozen Effect."
                },
                {
                    "ability_name": "Frost Shock",
                    "ability_type": "Active",
                    "ability_desc": "Aurora fires a Frost Energy Missle. Upon hitting enemies, it will detonate and deal 300 (+130% Total Magic Power) points of Magic Damage and slow enemies by 25%. Lasts 1.5s."
                },
                {
                    "ability_name": "Cold Destruction",
                    "ability_type": "Active",
                    "ability_desc": "Aurora summons a giant icy rock to bombard a designated target location, and all enemies hit will take 900 (+180% Total Magic Power) points of Magic Damage and be slowed by 90%. Lasts 1.5s.\nSurrounding enemies of the target will also take 450 (+90% Total Magic Power) points of Magic Damage and slowed by 60%. Lasts 1.5s."
                },
                {
                    "ability_name": "Bitter Frost",
                    "ability_type": "Active",
                    "ability_desc": "Aurora deals 530 (+180% Total Magic Power) points of Magic Damage at a designated target and slow the target by 80%. Lasts 1.5s."
                }
            ]
        },
        {
            "id": 9,
            "hero_name": "Badang",
            "image": "/images/Badang.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "245",
                "physical_attack": "105",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2441",
                "mana": "500",
                "attack_speed": "1",
                "hp_regen_rate": "34",
                "mana_regen_rate": "23",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Fist Crack",
                    "ability_type": "Active",
                    "ability_desc": "Badang quickly throws his fists in the designated direction and generates a Fist Wind at the moment of realse, dealing 120 (+50% Total Physical ATK) points of Physical Damage to enemies for several times. This fist wind enjoys Basic Attack Effect, and when the fist wind hits the bostacle, it will explode and deal 72 (+30% Total Physical ATK) points of Physical Damage.\nDuring the release of the skill, Badang generates a shield that absorbs 500 (+80% Total Physical ATK) points of Damage. This shield makes him immune to Control Effects."
                },
                {
                    "ability_name": "Chivalry Fist",
                    "ability_type": "Passive",
                    "ability_desc": "Badang's Basic Attack after every 4 times knocks enemies back and deals (+120% Total Physical ATK) points of Physical Damage to them. Enemies that are knocked back to the obstacles will be stunned. Lasts 0.8s. The Minions and Creeps will be stunned immediately. \nBadang's Fist Wind also has Passive effect."
                },
                {
                    "ability_name": "Fist Break",
                    "ability_type": "Active",
                    "ability_desc": "Badang dashes towars the designated direction. If he hits enemies along the way, he will knock them back and deal 230 (+50% Total Physical ATK) points of Physical Damage to them, leaving an obstacle along the path for 4s. Enemies that hit on the obstacle will take 130 (+30% Total Physical ATK) points of Physical Damage.\nUse Again: Remove the obstacles that he creates. If he doesn't hit any enemy along the way, the CD will be reduced by 30%."
                },
                {
                    "ability_name": "Qigong Fist",
                    "ability_type": "Active",
                    "ability_desc": " Badang coheres all his strength into his fists and performs an overwhelming Fist Wind, dealing 220 (+70% Total Physical ATK) points of Physical Damage to enemies on the path and slowing them by 50%.\nThe damage of Qigong Fist will trigger Basic Attack Effect and stack 1 time for the Chivalry Fist. All fist winds of Badang explode when hitting the obstacles left by him, dealing extra 155 (+50% Total Physical ATK) points of Physical Damage."
                }
            ]
        },
        {
            "id": 10,
            "hero_name": "Balmond",
            "image": "/images/Balmond.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "diamond_cost": "299",
                "movement_speed": "260",
                "physical_attack": "119",
                "physical_defense": "25",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2836",
                "attack_speed": "0.85",
                "hp_regen_rate": "47",
                "mana_regen_rate": "0",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Soul Lock",
                    "ability_type": "Active",
                    "ability_desc": "Balmond charges forward and deals 150 +60% Total Physical ATK) points of Physical Damage to enemy units along the way. After hitting a target, he will immediately stop and slow that enemy down by 40%. Lasts 2s."
                },
                {
                    "ability_name": "Cyclone Sweep",
                    "ability_type": "Active",
                    "ability_desc": "For 3s, Balmond brandishes a large axe and continuously deals 80 (+45% Total Physical ATK) points of Physical Damage to nearby enemies."
                },
                {
                    "ability_name": "Lethal Counter",
                    "ability_type": "Active",
                    "ability_desc": "Balmond raises a giant axe, dealing 350(+50% Total Physical ATK) plus 20% True Damage of the target's lost HP to enemies in a fan-shaped area in front of him, and slowing them by 40% for 2s. Deals up to 1300 points of damage to non-hero units."
                },
                {
                    "ability_name": "Bloodthirst",
                    "ability_type": "Passive",
                    "ability_desc": "Balmond recover 4% of his Max HP upon killing Minions, and recovers 10% when killing enemy heroes."
                }
            ]
        },
        {
            "id": 11,
            "hero_name": "Bane",
            "image": "/images/Bane.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "diamond_cost": "299",
                "movement_speed": "260",
                "physical_attack": "117",
                "physical_defense": "23",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2659",
                "mana": "433",
                "attack_speed": "0.85",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Rum",
                    "ability_type": "Active",
                    "ability_desc": "Bane takes a sip of rum, immediately regenerating 260 (+200% Total Magic Power) points of HP and increasing his Movement Speed by 30%. Lasts 2.5s.\n\nUse Again: Bane can then spit venom forward in a fan-shaped area, dealing 100 (+100% Total Physical ATK) to 200 (+200% Total Physical ATK) points of Magic Damage. The longer the venom is brewed, the more damage it will deal."
                },
                {
                    "ability_name": "Deadly Catch",
                    "ability_type": "Active",
                    "ability_desc": "Bane summons a school of sharks to move to a designated location. When they hit enemies, they will deal 500 (+160% Total Physical ATK) points of Physical Damage and decrease Movement Speed by 30% and Attack Speed by 50%. Lasts 3s. Deals 40% of damage to Turrets."
                },
                {
                    "ability_name": "Shark Bite",
                    "ability_type": "Passive",
                    "ability_desc": "Bane's weapon is infused with Tidal Energy every 10s. Damage of his next basic attack is increased by 60-90% and deals extra splash damage to nearby enemies. \n\nHitting an enemy hero with skills will decrease the infusion time of Tidal Energy by 2.5s. Hitting non-hero units will decrease  the infusion time of Tidal Energy by 1s"
                },
                {
                    "ability_name": "Crab Claw Cannon",
                    "ability_type": "Active",
                    "ability_desc": "Bane fires a Crab Claw Cannon in a designated direction, dealing 180 (140% Total Physical ATK) points of Physical Damage to the first target hit. Then the Cannon will rebound to an enemy unit randomly, dealing 150% damage of this skill. (Attack enemy heroes first) if Bane uses Crab Claw Cannon and kills the target, Bounce Damage will increased by."
                }
            ]
        },
        {
            "id": 12,
            "hero_name": "Baxia",
            "image": "/images/Baxia.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "125",
                "physical_defense": "24",
                "magic_resistance": "10",
                "hp": "2769",
                "mana": "422",
                "attack_speed": "0.8",
                "hp_regen_rate": "42",
                "mana_regen_rate": "15",
                "category": "Tank"
            },
            "abilities": []
        },
        {
            "id": 13,
            "hero_name": "Belerick",
            "image": "/images/Belerick.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "250",
                "physical_attack": "110",
                "physical_defense": "20",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "3109",
                "mana": "450",
                "attack_speed": "0.81",
                "hp_regen_rate": "62",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Nature's Seed",
                    "ability_type": "Active",
                    "ability_desc": "Belerick releases an energy orb forward that dissappears when hitting an enemy hero, dealing 250(+60% Total Magic Power) points of Magic Damage to all targets hit and slows them by 40%. Marks enemy targets with Nature's Seed."
                },
                {
                    "ability_name": "Power Of Nɑture",
                    "ability_type": "Active",
                    "ability_desc": "Belerick sacrifices his HP for a 50% increase in movement speed and strengthens his next basic attack. His next basic attack deals 250 + 6% if the target's lost HP. Belerick also immobilizes the target. Belerick then recovers HP (dependent upon his HP loss)."
                },
                {
                    "ability_name": "Nature's Strike",
                    "ability_type": "Active",
                    "ability_desc": "Belerick scarifices 300 points of HP to increase his Movement Speed by 40% and strengthen his next Basic Attack, which deals Physical Damage equal to 250 points plus 8% of his lost HP, and slow the target by 30% for 2s. Belerick also regenerates certain amounts of HP depending on his lost HP. MEanwhile, Belerick puts Nature's Seed effect to enemies. Lasts 1.2s."
                },
                {
                    "ability_name": "Flower of Life",
                    "ability_type": "Passive",
                    "ability_desc": "The HP obtained from Equipment are increased by 15%. For every 225 points of damage inflicted upon Belerick, the Flower of Life attacks in the direction of an enemy unit, dealing Magic Damage equal to 50 points plus 2% of Belerick's Max HP.  The Flower of Life first attacks nearby enemy units marked with Nature's Seed."
                },
                {
                    "ability_name": "Nature's Vine",
                    "ability_type": "Active",
                    "ability_desc": "Belerick casts vines in a designated area, dealing 250 (+60% Total Magic Power) points of Magic Damage to enemies on the path, and immobilizing them by 1s. To minions, 50% extra damage will be dealt."
                },
                {
                    "ability_name": "Nature's Shield",
                    "ability_type": "Active",
                    "ability_desc": "Belerick recovers 10% of his HP and creates a guarded area. The teammates who have entered the area will enjoy the effect of Flower of Life Shortly. When allied heroes within that area take damage, Belerick will absorb 40% of their damage taken. While this skill is active, damage dealt to Belerick is reduced by 30%. \nUse Again: Belerick cancels Nature's Shield."
                }
            ]
        },
        {
            "id": 14,
            "hero_name": "Bruno",
            "image": "/images/Bruno.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "diamond_cost": "399",
                "movement_speed": "240",
                "physical_attack": "128",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2522",
                "mana": "439",
                "attack_speed": "0.85",
                "hp_regen_rate": "30",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Mecha Legs",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Bruno's skills cause damage, his Crit Chance will be increased by 4%. Stacks up to 5 times.\n\nSince Mecha Legs are infused with power, Bruno can deal more damage, but the extra ATK speed only takes effect by 80%."
                },
                {
                    "ability_name": "Volley Shot",
                    "ability_type": "Active",
                    "ability_desc": "Bruno infuses the power to his Mecha Legs, his next Basic Attack will kick a powerball directly and hit an enemy target, dealing 110 (+105% Total Physical ATK) points of Physical Damage and slowing the target by 40% for 0.5s.\nThe powerball can be rebounded to Bruno when hitting the target. Bruno or his teammates can pick up the energy ball to reduce the CD of Flying Tackle by 1s and Bruno will have a powerball again."
                },
                {
                    "ability_name": "Flying Tackle",
                    "ability_type": "Active",
                    "ability_desc": "Bruno makes a forward slide tackle, dealing 140 (+40% Total Physical ATK) points of Physical Damage to enemies and stunning them for 0.5s.\n\nIf Bruno casts Flying Tackle while there is a powerball rebounding to him, he will pull back this powerball immediately."
                },
                {
                    "ability_name": "Wave of the World",
                    "ability_type": "Active",
                    "ability_desc": "Bruno kicks an energy ball at a designated hero, dealing 250 (+83% Total Physical ATK) points Physical Damage, knocking back the target and reducing the Physical Defense of the target by 3. Afterwards the energy ball will ricochet among enemy heroes ( Up to 10 times). Every hit deals 150 (+50% Total Physical ATK) points of Physical Damage. Physical Defense Reducing effect lasts 8s. Stacks up to 3 times."
                }
            ]
        },
        {
            "id": 15,
            "hero_name": "Carmilla",
            "image": "/images/Carmilla.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "197",
                "physical_attack": "118",
                "physical_defense": "10",
                "magic_resistance": "13",
                "hp": "2378",
                "mana": "477",
                "attack_speed": "112",
                "hp_regen_rate": "45",
                "mana_regen_rate": "34",
                "category": "Support"
            },
            "abilities": []
        },
        {
            "id": 16,
            "hero_name": "Chang'e",
            "image": "/images/Chang'e.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "115",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "16",
                "magic_resistance": "10",
                "hp": "2301",
                "mana": "505",
                "attack_speed": "0.81",
                "hp_regen_rate": "34",
                "mana_regen_rate": "21",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Crescent Moon",
                    "ability_type": "Active",
                    "ability_desc": "Chang'e summons a Crescent Moon to bless herself, gaining 400 (+120% Total Magic Power) points of Shield, while increasing her Movement Speed by 15%.\nWhile the Shield is active, her skills and Basic Attack are enhanced.\nEnhanced Basic Attack: Each time Chang'e performs a Basic Attack, the Crescent Moon will deal (+20% Total Physical ATK)(+30% Total Magic Power) points of Magic Damageto enemy targets as well."
                },
                {
                    "ability_name": "Meteor Shower",
                    "ability_type": "Active",
                    "ability_desc": "Chang'e gathers strength and increases her Movement Speed by 20% for 4s. Meanwhile, she launches 30 Meteors forward, each of which deals 65 (+15% Total Magic Power) points of Magic Damage (Deals extra 100% damage to Minions and Creeps).\n\nCrescent Moon: Crescent Moon will cast Meteors together with Chang'e, each which deal 33% of Chang'e's damage dealt."
                },
                {
                    "ability_name": "Trouble Maker",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Chang'e deals damage to enemy units, she will leave a mark on them and her next skill damage dealt to those with marks will be increased by 2% (up to 40%)."
                },
                {
                    "ability_name": "Starmoon Shockwave",
                    "ability_type": "Active",
                    "ability_desc": "Chang'e sends an energy ball forward, dealing 340 (+80% Total Magic Power) points of Magic Damage to enemies and slows them by 40%. Lasts 1.5s.\nCrescent Moon: Crescent Moon will send 4 energy balls alongside Chang'e, each of which deals 20% of Chang'e's damage dealt and slows enemies. (Slowing Effect can be stacked up to 75%.)"
                }
            ]
        },
        {
            "id": 17,
            "hero_name": "Chou",
            "image": "/images/Chou.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "260",
                "physical_attack": "121",
                "physical_defense": "23",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2708",
                "mana": "0",
                "attack_speed": "0.88",
                "hp_regen_rate": "39",
                "mana_regen_rate": "0",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Only Fast",
                    "ability_type": "Passive",
                    "ability_desc": "After every 8 yards Chou moves, his next Basic Attack will deal 200% of damage (can't be critical) and shortly slow enemies by 80%."
                },
                {
                    "ability_name": "Jeet Kune Do",
                    "ability_type": "Active",
                    "ability_desc": "Chou punches forward for 3 times continously. Each punch deals 180 (+70% Total Physical ATK) points of Physical Damage. The 3rd attack knocks nearby enemies into the air.\nThe 3rd use of this skill resets the CD of Shunpo."
                },
                {
                    "ability_name": "Shunpo",
                    "ability_type": "Active",
                    "ability_desc": "Chou dashes forward, becoming immune to Control Effects during the dash. After the dash, Chou increases his Physical Pentration by 15 points and obtains a Shield that can absorb 200 (+150% Total Physical ATK) points of damage for 2s."
                },
                {
                    "ability_name": "The Way of Dragon",
                    "ability_type": "Active",
                    "ability_desc": "Chou casts a roundhouse kick to knock back enemies and deals 400 (+200% Total Physical ATK) points of Physical Damage.\n\nUse Again: Chou will chase up the enemies in the air, dealing at least 400 (+200% Total Physical ATK) points of Physical Damage."
                }
            ]
        },
        {
            "id": 18,
            "hero_name": "Claude",
            "image": "/images/Claude.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "137",
                "physical_defense": "40",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "0",
                "hp": "3443",
                "mana": "755",
                "attack_speed": "0.88",
                "hp_regen_rate": "46",
                "mana_regen_rate": "65",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Art of Thievery",
                    "ability_type": "Active",
                    "ability_desc": "Claude attacks enemies within a fan-shaped area, dealing 160 (+40% Total Physical ATK) points of Physical Damage and reducing their Movement Speed by 20% and Attack Speed by 10%. When he hits an enemy hero or a non-hero unit, his Movement Speed will be increased by 7% and Attack Speed will be increased by 3.5%. Lasts 6s. Stacks up to 10 times."
                },
                {
                    "ability_name": "Battle Side-by-Side",
                    "ability_type": "Passive",
                    "ability_desc": "Dexter launches an attack to help Claude, hitting again to the enemies hit by Claude's Basic Attack.\nDeals 35% of Claude's Basic Attack and enjoys the effects attached by Claude's Basic Attack"
                },
                {
                    "ability_name": "Blazing Duet",
                    "ability_type": "Active",
                    "ability_desc": "Claude and Dexter unleash a barrage atacck, dealing continuous damage to enemies within the duo's surrounding area. Lasts for 3s. Every hit inflicts 80 (+15% Total Physical ATK) points of Physical Damage to 2 enemies. This damage enjoys the effects attached to Claude's Basic Attack. Also generates a shield with 20 (+3% Total Physical ATK) points. \nExtra Attack Speed will also increase hit rate. When Claude's attack is in full burst, enemy Minions will take 400%."
                },
                {
                    "ability_name": "Battle Mirror Image",
                    "ability_type": "Active",
                    "ability_desc": "Claude leaves a mirror image of Dexter at a designated location. Dexter's mirror image automaticall attacks enemies. Lasts 5.5s. Claude can activate this kill again to switch places with the mirrior image.\nDexter's Basic Attack deals 35% of Claude's Basic Attack Damage and enjoys the effects attached by Claude's Basic Attack."
                }
            ]
        },
        {
            "id": 19,
            "hero_name": "Clint",
            "image": "/images/Clint.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "movement_speed": "240",
                "physical_attack": "115",
                "magic_power": "0",
                "armor": "20",
                "magic_resistance": "10",
                "hp": "2530",
                "mana": "450",
                "attack_speed": "0.84",
                "hp_regen_rate": "36",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Quick Draw",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Clint casts a skill, his next Basic Attack penetrates a line of targets, dealing Physical Damage that can inherit 120% of ATK Effect. This skill can be critical."
                },
                {
                    "ability_name": "Blind Smoke",
                    "ability_type": "Active",
                    "ability_desc": "Clint projects a smoke bomb, dealing 200 (+50% Total Physical ATK) points of Physical Damage to enemies in the area. The hit rate of enemies' Basic Attacks in the smoke area is decreased by 25% and their Movement Speed is decreased by 40%."
                },
                {
                    "ability_name": "Heel Rope",
                    "ability_type": "Active",
                    "ability_desc": "Clint shoots a trap net forwards, dealing 140 (+30% Total Physical ATK)(+30% Total Magic Power) points of Physical Damage to the first enemy hit and slowing them by 40% for 2. He will also jump back a little at the same time."
                },
                {
                    "ability_name": "Howitzer",
                    "ability_type": "Active",
                    "ability_desc": "Clint launches a grenade in a designated direction. The grenade explodes and deals 250 (+80% Total Physical ATK) points of Physical Damage to enemies.\n1 grenade can be restored every 10s up to 5. Restore time is affected by Cooldown Reduction."
                }
            ]
        },
        {
            "id": 20,
            "hero_name": "Cyclops",
            "image": "/images/Cyclops.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "112",
                "physical_defense": "18",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2521",
                "mana": "500",
                "attack_speed": "0.8",
                "hp_regen_rate": "38",
                "mana_regen_rate": "20",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Planets Attack",
                    "ability_type": "Active",
                    "ability_desc": "Cyclops use the power of the stars to generate a starlit sphere spinning around him and increases 30% of his own Movement Speed within 2s. The sphere will attack nearby enemy heroes first, dealing 210 (+50% Total Magic Power) points of Magic Damage to them. (Damages dealt to the same target will decay.)"
                },
                {
                    "ability_name": "Star Power Lockdown",
                    "ability_type": "Active",
                    "ability_desc": "Cyclops creates a gigantic magic sphere filled with a planetary power to chase his enemy, dealing 500 (+220% Total Magic Power) Magic Damage. The target will be immobilized for 1s-2s based on the distance the sphere travels."
                },
                {
                    "ability_name": "Starlit Hourglass",
                    "ability_type": "Passive",
                    "ability_desc": "When Cyclops casts this skill and hits enemies, all skill CD will be decreased by 0.5s."
                },
                {
                    "ability_name": "Stardust Shock",
                    "ability_type": "Active",
                    "ability_desc": "Cyclops casts two shock waves of stardust towards, each dealing 245(+60% Total Magic Power) points of Magic Damage to the enemy."
                }
            ]
        },
        {
            "id": 21,
            "hero_name": "Diggie",
            "image": "/images/Diggie.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "250",
                "physical_attack": "115",
                "physical_defense": "18",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2351",
                "mana": "490",
                "attack_speed": "0.8",
                "hp_regen_rate": "36",
                "mana_regen_rate": "20",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Time Bomb",
                    "ability_type": "Active",
                    "ability_desc": "Throws an alarm clock at the targeted direction, it will explode after a set amount of time dealing 300 points of in an area and stunning 1.2s, damage scales with tick time (during ticking, tap again to immedaitely detonate the bomb, if the bomb is detonated before 2s, it will only slow instead of stun)"
                },
                {
                    "ability_name": "Disdain",
                    "ability_type": "Active",
                    "ability_desc": "Displays disdain at the enemy, dealing a small amount of damage to surrounding enemies will letting out anger. This damage can interrupt regeneration and recalls"
                },
                {
                    "ability_name": "Egg Dance",
                    "ability_type": "Active",
                    "ability_desc": "Diggie happily dance his hometown jig, dealing a small amount of damage to enemies. This damage can interrupt regeneration and recalls"
                },
                {
                    "ability_name": "Victory Prayers",
                    "ability_type": "Active",
                    "ability_desc": "Rolls on the ground praying for the enemy's base to explode immediately, legend says this type of action has a 0% success rate"
                },
                {
                    "ability_name": "Auto Alarm Bomb",
                    "ability_type": "Active",
                    "ability_desc": "Diggie throws an owl alarm at the designated direction. The alarm will automatically chase the enemies nearby, dealing 550 (+120% Total Magic Power) points of Magic Damage to them and slowing them by 30%. If there is no enemy hero nearby, it will stay at the spot for 30s.\nThis skill can be stored for 3 times and affected by CD Reduction."
                },
                {
                    "ability_name": "Time Journey",
                    "ability_type": "Active",
                    "ability_desc": "Diggie provides a shield that absorbs 400 (+150% Total Magic Power) damage to him and surrounding allies, and becomes immune to Control Effects. Lasts 3s."
                },
                {
                    "ability_name": "Young Again",
                    "ability_type": "Passive",
                    "ability_desc": "Upon Death, Diggie will become an egg. He can move and receive all-new chick abilities. Diggie cannot be targeted in egg form, and after a period of time, Diggie will revive."
                },
                {
                    "ability_name": "Reverse Time",
                    "ability_type": "Active",
                    "ability_desc": "Diggie marks a designated target. After 4s, the target is pulled back to a set location, taking 150 (+50% Total Magic Power) points of Magic Damage and slowed down by 80%. If enemies escape too far away, they will be pulled back and take damage immediately."
                }
            ]
        },
        {
            "id": 22,
            "hero_name": "Dyrroth",
            "image": "/images/Dyrroth.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "266",
                "physical_attack": "117",
                "physical_defense": "19",
                "magic_resistance": "10",
                "hp": "2758",
                "attack_speed": "0.92",
                "hp_regen_rate": "41",
                "category": "Fighter"
            },
            "abilities": []
        },
        {
            "id": 23,
            "hero_name": "Esmeralda",
            "image": "/images/Esmeralda.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "movement_speed": "240",
                "physical_attack": "114",
                "physical_defense": "21",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2573",
                "mana": "502",
                "attack_speed": "0.8",
                "hp_regen_rate": "36",
                "mana_regen_rate": "20",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Stardust Dance",
                    "ability_type": "Active",
                    "ability_desc": "Esmeralda waves Stardust and Frostmoon and deals 210 (+60% Total Physical ATK) points of Physical Damage and 210 (+90% Total Magic Power) points of Magic Damage to nearby enemies. Dealing damage to enemies reduces the CD of Frstommon Shield by 1s."
                },
                {
                    "ability_name": "Starmoon Casket",
                    "ability_type": "Passive",
                    "ability_desc": "Esmeralda manipulates Stardust and Frostmoon. Each of her Basic Attack and skills deal damages twice - Stardust Deals Physical Damage and Frostmoon deals Magic Damage and gives the target a shield equal to 150% of Frostmoon's damage dealt.\nThe damage dealt by Esmeralda ignores all shield effects and transforms her Shield into her HP at the same time."
                },
                {
                    "ability_name": "Falling Starmoon",
                    "ability_type": "Active",
                    "ability_desc": "Esmeralda coheres the power of Astrospace into her two weapons - Stardust and Frostmoon. The longer the duration lasts, the greater the power will be. Use again this skill to cast the Stardust to the designated location, dealing 350 (+90% Total Physical ATK) points of Physical Damage, and then Esmeralda moves to the designated location to cast Frostmoon, dealing 350 (+140% Total Magic Power) points of Magic Damage and immobilizing enemies in the area for 1.2s."
                },
                {
                    "ability_name": "Frostmoon Shield",
                    "ability_type": "Active",
                    "ability_desc": "Esmeralda generates 350 (+150% Total Magic Power) points of Shield to herself and increases her Movement Speed by 40% within 5s. Meanwhile, she gradually transforms the shields of her nearby enemies into her own shield. The Speed increased decays in a short time."
                }
            ]
        },
        {
            "id": 24,
            "hero_name": "Estes",
            "image": "/images/Estes.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "240",
                "physical_attack": "115",
                "physical_defense": "13",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2161",
                "mana": "545",
                "attack_speed": "10",
                "hp_regen_rate": "36",
                "mana_regen_rate": "18",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Moonlight Immersion",
                    "ability_type": "Active",
                    "ability_desc": "Estes restores 250 (+30% Total Magic Power) points of HP for the target hero immediately and links himself with the target for 3s, restoring 325 (+30% Total Magic Power) points of HP for the target slowly. Linking with an ally will also improve his own Attack, and increase the energy charging speed of the Code of Moon Elves. (Scales with the number and the attributes of allied heroes.) \nBeing too far from the target will break the link."
                },
                {
                    "ability_name": "Domain of Moon God",
                    "ability_type": "Active",
                    "ability_desc": "Estes drops a flood of moonlight upon the designated area, dealing 350 (+70% Total Magic Power) points of Magic Damage to enemy units within it. Afterwards, it turns to a domain of Moon Goddess. Enemies will be slowed down by 90% when they touch the barrier of the domain area. Lasts 1.5s. (This slowing Effect will disappear slightly with the time.)"
                },
                {
                    "ability_name": "Blessing of Moon Goddess",
                    "ability_type": "Active",
                    "ability_desc": "Estes will immediately cast ehanced Moonlight Immersion to all allied heroes nearby. Enhance Moonlight Immersion within 8s. Meanwhile, he will regenerate 1260 (+105% Total Magic Power) points of HP continously."
                },
                {
                    "ability_name": "Scripture of the Moon Elf",
                    "ability_type": "Passive",
                    "ability_desc": "Code of Moon Elves will charge energy into Estes slowly. When it stacks up to 100, it will improve his next Basic Attack, dealing 250 (+100% Total Physical ATK) (+150% Total Magic Power) points of Magic Damage to the target. The damage will ricochet, dealing 125 (+50% Total Physical ATK) (+75% Total Magic Power) points of Magic Damage to nearby enemies and slowing them by 60%. Lasts 1.5s."
                }
            ]
        },
        {
            "id": 25,
            "hero_name": "Eudora",
            "image": "/images/Eudora.jpg",
            "stats": {
                "battle_point_cost": "2000",
                "diamond_cost": "299",
                "movement_speed": "250",
                "physical_attack": "112",
                "physical_defense": "19",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2524",
                "mana": "468",
                "attack_speed": "0.8",
                "hp_regen_rate": "38",
                "mana_regen_rate": "16",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Thunderstruck",
                    "ability_type": "Active",
                    "ability_desc": "Eudora summons a great storm of lightning, dealing 700 (+270% Total Magic Power) points of Magic Damage to the main target and 400 (+180% Total Magic Power) points of Magic Damage to other enemies around the target. Enemies under the Superconductor state take 15% more damage."
                },
                {
                    "ability_name": "Superconductor",
                    "ability_type": "Passive",
                    "ability_desc": "Eudora's skills inflict the target with the Superconductor effect that makes them take more Magic Damage from her."
                },
                {
                    "ability_name": "Electric Arrow",
                    "ability_type": "Active",
                    "ability_desc": "Eudora strikes an enemy with a bolt of lightning, dealing 350 (+105% Total Magic Power) points of Magic Damage and stunning the target for 0.75s. Enemies under the Superconductor state are stunned for 0.75s more."
                },
                {
                    "ability_name": "Forked Lightning",
                    "ability_type": "Active",
                    "ability_desc": "Eudora casts a forked lightning to deal 450 (+230% Total Magic Power) points of Magic Damage to enemies in a fan-shaped area in front of her, inflicting the Superconductor effect that reduces MAgic Defense by 15 points."
                }
            ]
        },
        {
            "id": 26,
            "hero_name": "Fanny",
            "image": "/images/Fanny.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "265",
                "physical_attack": "126",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2526",
                "mana": "0",
                "attack_speed": "0.89",
                "hp_regen_rate": "33",
                "mana_regen_rate": "0",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Air Superiority",
                    "ability_type": "Passive",
                    "ability_desc": "According to her flying speed, Fanny's damage while flying is increased by 15% to 30% and leaves a Prey Mark on the target (Stack up to 2 times). Each stack regens energy for 10 points when she deals damage to enemies with Prey Mark. (Energy regen effec decays if she deals damage to multiple enemy heroes in a short time)."
                },
                {
                    "ability_name": "Tornado Strike",
                    "ability_type": "Active",
                    "ability_desc": "Fanny whirls her blade, dealing 260 (+90% Total Physical ATK) points of Physical Damage to nearby enemies."
                },
                {
                    "ability_name": "Steel Cable",
                    "ability_type": "Active",
                    "ability_desc": "Fanny throws out a cable that draws her to the first obstacle that it touches. Each successive use of this skill within 3s decreases its energy cost by 1 and changes her flying direction. \nIf energy is sufficient and she hits an enemy while flying, Tornado Strike will be triggered."
                },
                {
                    "ability_name": "Cut Throat",
                    "ability_type": "Active",
                    "ability_desc": "Fanny initiates a quick attack on an enemy, dealing 500 (+240% Total Physical ATK) points of Physical Damage. Each stack of Prey Mark of enemies will increase her damage by 20%."
                }
            ]
        },
        {
            "id": 27,
            "hero_name": "Faramis",
            "image": "/images/Faramis.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "222",
                "physical_defense": "36",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "3700",
                "mana": "0",
                "attack_speed": "0.94",
                "hp_regen_rate": "39",
                "mana_regen_rate": "19",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Vicious Retrieval",
                    "ability_type": "Passive",
                    "ability_desc": "When units die near Faramis, they leave their souls at the spot. By retrieving the souls, Faramis recover HP by 150 (+60% Total Magic Power) points. Each soul shortens Faramis's resurrecting time by 5-7% (Up to 90% and scales with level)."
                },
                {
                    "ability_name": "Ghost Bursters",
                    "ability_type": "Active",
                    "ability_desc": "Faramis extracts a burst of Evil Spirits in a fan-shaped area in front of him. The outburst deals 330 (+120% Total Magic Power) points of Magic Damage, then the burst splits to deal extra 275 (+100% Total Magic Power) points of Magic Damage. (Splits up to 3 times on enemy heroes and up to 1 on non-hero units)."
                },
                {
                    "ability_name": "Shadow Stampede",
                    "ability_type": "Active",
                    "ability_desc": "Faramis enters the Shadow State, increasing Movement Speed by 70% and 60 points of Physical and Magical Defense for 3s. Faramis leaves the Mark of Shadow to enemy heroes that come into contact with him and deals 325 (+60% Total Magic Power) points of Magic Damage. When he quits Shadow State, all the enemy heroes that have been marked will be pulled to Faramis and take 325 (+60% Total Magic Power) points of Magic Damage. Meanwhile he restores 160 (+50% Total Magic Power) points of HP."
                },
                {
                    "ability_name": "Cult Altar",
                    "ability_type": "Active",
                    "ability_desc": "Faramis summons an altar that lasts 10s. Allied heroes who are eliminated within this altar will immediately surrect, obtaining 80% HP and 100% Attack. The resurrecting lasts up to 10 seconds."
                }
            ]
        },
        {
            "id": 28,
            "hero_name": "Franco",
            "image": "/images/Franco.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "movement_speed": "260",
                "physical_attack": "116",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "25",
                "magic_resistance": "10",
                "hp": "2709",
                "mana": "440",
                "attack_speed": "0.83",
                "hp_regen_rate": "46",
                "mana_regen_rate": "10",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Wasteland Force",
                    "ability_type": "Passive",
                    "ability_desc": "Franco increases Movement Speed by 10% and regen 1% of Max HP per second if he takes no damage for a short time."
                },
                {
                    "ability_name": "Iron Hook",
                    "ability_type": "Active",
                    "ability_desc": "Franco launches an iron hook to a designated direction. The hook will snag the first unit, and dealing 550 (100% Total Physical ATK) points of Physical Damage and dragging the unit back to Franco."
                },
                {
                    "ability_name": "Fury Shock",
                    "ability_type": "Active",
                    "ability_desc": "Francho lashes out, dealing Physical Damage equal to 300 plus 3% of his Max HP to nearby enemies and slowing them by 70% for 1.5s."
                },
                {
                    "ability_name": "Bloody Hunt",
                    "ability_type": "Active",
                    "ability_desc": "Franco suppresses a designated enemy unit for 1.8s, and then hacks them for 6 times continuously, dealing 60 (+70% Total Physical ATK) points of Physical Damage with each attack."
                }
            ]
        },
        {
            "id": 29,
            "hero_name": "Freya",
            "image": "/images/Freya.jpg",
            "stats": {
                "battle_point_cost": "0",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "109",
                "physical_defense": "22",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "0",
                "hp": "2801",
                "mana": "462",
                "attack_speed": "0.88",
                "hp_regen_rate": "49",
                "mana_regen_rate": "14",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Valkyrie",
                    "ability_type": "Active",
                    "ability_desc": "Freya enters Valkyrie state, dealing 360 (+150% Extra Physical ATK) points of Physical Damage to surrounding enemies and slowing them by 40%. Lasts 2s. Meanwhile her Attack is increased by 20, and Physical and Magic Defense are increased by 15. Using this skill grants a shield that absorbs at least 200 (+50% Total Physical ATK) Damage, based on the number of enemies she hits. Lasts 10s."
                },
                {
                    "ability_name": "Godspeed Strike",
                    "ability_type": "Active",
                    "ability_desc": "Freya enhances her Attack Speed of the first 3 Basica Attacks within 5s. Attack 3 will stun targets for 1s in a fan-shaped area and deal extra 180 (+60% Extra Physical ATK) points of Physical Damage to them."
                },
                {
                    "ability_name": "Wings of Faith",
                    "ability_type": "Active",
                    "ability_desc": "Freya jumps to a designated area, dealing 240 (+100% Extra Physical ATK) points of Physical Damage to enemies in the area and pulling them to the center."
                },
                {
                    "ability_name": "Spirit Contact",
                    "ability_type": "Passive",
                    "ability_desc": "Freya generates a sacred orb surrounding her every 2 Basic Attacks. When she has 3 orbs around her, the orbs will move faster and each orb will 30 (+60% Total Physical ATK) damage to enemies. (The orb has no effect on Minions)."
                }
            ]
        },
        {
            "id": 30,
            "hero_name": "Gatotkaca",
            "image": "/images/Gatotkaca.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "120",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "20",
                "magic_resistance": "10",
                "hp": "2709",
                "mana": "440",
                "attack_speed": "0.82",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Avatar of the Guardian",
                    "ability_type": "Active",
                    "ability_desc": "Gatokaca jumps to the designated area, knocking nearby enemies into the air for 1s and dealing 500 (+300% Total Magic Power) points of Magic Damage. Enemies near the center of the area will be knocked into the air for a longer duration. Enemies on the fringes will be pulled to the center. Camera will follow the Skill Indicator but will not provide extra view."
                },
                {
                    "ability_name": "Steel Bones",
                    "ability_type": "Passive",
                    "ability_desc": "Gatokaca converts 3% of his lost HP to Physical Defense, up to 250. Dealing damage to enemies who have higher HP than him regenerates 110-250 HP (increases with level) plus HP equal to 0.5x of his Physical Defense. This effect can only trigger once every 6s."
                },
                {
                    "ability_name": "Blast Iron Fist",
                    "ability_type": "Active",
                    "ability_desc": "Gatokaca shatters the ground in front of him, dealing 190 (+90% Total Magic Power) points of Magic Damage. Deals 30 (+20% Total Magic Power) points of Magic Damage per second to enemies trapped in Gatokaca's shattered area and slows them by 40%."
                },
                {
                    "ability_name": "Unbreakable",
                    "ability_type": "Active",
                    "ability_desc": "Gatokaca charges and loudly shouts towards a designated direction, taunting enemies to attack him and deals 90 (+60% Total Magic Power) points of Magic Damage. The taunt duration is determined by how long Gatokaca charges this skill. Taunt lasts for up to 1.3s. Within the first 2.5s of casting this skill, Gatokaca reflects damage upon nearby enemies and deals up to 90 plus 1.5% of his Max HP points of Magic Damage."
                }
            ]
        },
        {
            "id": 31,
            "hero_name": "Gord",
            "image": "/images/Gord.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "movement_speed": "240",
                "physical_attack": "110",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "13",
                "magic_resistance": "10",
                "hp": "2478",
                "mana": "570",
                "attack_speed": "0.77",
                "hp_regen_rate": "32",
                "mana_regen_rate": "25",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Mystic Projectile",
                    "ability_type": "Active",
                    "ability_desc": "Gord throws a Mystic Projectile that jumps forward at a designated area. Upon hitting an enemy unit, the Projectile will deal 270 (+80% Total Magic Power) points of Magic Damage in the area and stun enemies for 1."
                },
                {
                    "ability_name": "Mystic Injunction",
                    "ability_type": "Active",
                    "ability_desc": "Gord summons an energy field, dealing 80 (+20% Total Magic Power) points of Magic Damage every 0.45s."
                },
                {
                    "ability_name": "Mystic Gush",
                    "ability_type": "Active",
                    "ability_desc": "Gord fires a sustained blast of energy in a designated direction, dealing 190 (+60% Total Magic Power) points of Magic Damage every 0.3s to enemies and slowing them by 10%. Lasts 3s.\n\nThe direction of the blast can be changed by using the Left Joystick during this time."
                },
                {
                    "ability_name": "Mystic Favor",
                    "ability_type": "Passive",
                    "ability_desc": "Dealing 4 hits of basic attack or skill damge to the same target, within a short period of time, grants a bonus of 160 (+70% Total Magic Power) points of True Damage on the next attack."
                }
            ]
        },
        {
            "id": 32,
            "hero_name": "Granger",
            "image": "/images/Granger.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "125",
                "physical_defense": "15",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2490",
                "mana": "0",
                "attack_speed": "0.82",
                "hp_regen_rate": "27",
                "mana_regen_rate": "0",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Death Sonata",
                    "ability_type": "Active",
                    "ability_desc": "Granger transforms his violin into a super cannon and fills it with all bullets. He then shoots 2 Super Bullets forward a time. The Super Bullet ignores Minions along the way and only hits enemy heroes. Super Bullets explode upon hititng the first enemy hero, dealing 150 (+100% Total Physical ATK) points of Physical Damage to enemies nearby and slowing them by 80%. Each time Granger shoots a Super Bullet, he can move to another location. When Death Sonata ends, the CD of this skill will be reduced by 15s for every 2 remaining Super Bullets."
                },
                {
                    "ability_name": "Rhapsody",
                    "ability_type": "Active",
                    "ability_desc": "Granger fills his gun with all bullets and shoots them forward. Each bullet deals 30 (+80% Total Physical ATK) points of Physical Damage to enemies."
                },
                {
                    "ability_name": "Caprice",
                    "ability_type": "Passive",
                    "ability_desc": "Granger can fill his gun with up to 6 bullets at a time. Each 6th bullet deals Critical Damage. Granger's Basic Attack will deal more damage, but he gains 50% Attack Speed from Equipment or Emblems."
                },
                {
                    "ability_name": "Rondo",
                    "ability_type": "Active",
                    "ability_desc": "Granger blinks in the designated direction, and his next 2 Basic Attacks deal extra 10% of damage in 5s. \nEach time Thapsody hits an enemy hero, the CD of this skill will be reduced by 0.5s."
                }
            ]
        },
        {
            "id": 33,
            "hero_name": "Grock",
            "image": "/images/Grock.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "135",
                "physical_defense": "21",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2819",
                "mana": "430",
                "attack_speed": "0.81",
                "hp_regen_rate": "42",
                "mana_regen_rate": "42",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Power Of Nature",
                    "ability_type": "Active",
                    "ability_desc": "Raises weapon to sweep nearby enemies, dealing 300(+40%Extra Physical ATK) [C3physical damage] and slowing them down for 2 seconds. Damage scales with charge time. Stay near to wall while casting this skill to become immune to Crowd Control effects."
                },
                {
                    "ability_name": "Power of Nature",
                    "ability_type": "Active",
                    "ability_desc": "Grock raises weapon to sweep nearby enemies, dealing 300 (+40% Total Physical ATK) points of Physical Damage and slowing them by 40%. Lasts 2s. Damage scales with charge time. Stay near to a wall while casting Power of Nature to become immune to Crowd Control Effects."
                },
                {
                    "ability_name": "Guardian's Barrier",
                    "ability_type": "Active",
                    "ability_desc": "Grock releases a shockwave towards a designated location, dealing 300 (+50% Total Physical ATK) points of Physical Damage. Then the shockwave becomes a stone wall that blockes enemies for 5s."
                },
                {
                    "ability_name": "Wild Charge",
                    "ability_type": "Active",
                    "ability_desc": "Grock charges forward, dealing 300 (+50% Total Physical ATK) points of Physical Damage to enemies on the path. Hitting a wall or turret allows him to deal 600 (+150% Total Physical ATK) points of Physical Damage to the nearby enemies and reduce the CD of this skill by 30%."
                },
                {
                    "ability_name": "Ancestral Gift",
                    "ability_type": "Passive",
                    "ability_desc": "When Grock is near a wall or turret, his Movement Speed will be increased by 10%, Physical and Magical Defense by 15 (+8*Hero Level) and HP Regen by 15 (+8*Hero Level)."
                }
            ]
        },
        {
            "id": 34,
            "hero_name": "Guinevere",
            "image": "/images/Guinevere.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "126",
                "physical_defense": "18",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2528",
                "mana": "0",
                "attack_speed": "0.92",
                "hp_regen_rate": "39",
                "mana_regen_rate": "0",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Spatial Migration",
                    "ability_type": "Active",
                    "ability_desc": "Guinevere blinks to designated direction, leaving a temporary magical Image. When the Image takes damage, it will deal Magic Damage to the attackers and restore some of Guinevere's Super Magic."
                },
                {
                    "ability_name": "Violet Requiem",
                    "ability_type": "Active",
                    "ability_desc": "Guinevere completely releases her super magic, dealing 650 (+500% Total Magic Power) points of Magic Damage to nearby enemies within 2s. If the enemies are knocked airborne, they will have an extra knock-airborne effect. Each enemy will be knocked airborne additionally for 6 times. During her casting time, Guinevere is immune to Control Effects."
                },
                {
                    "ability_name": "Magic Thump",
                    "ability_type": "Active",
                    "ability_desc": "Guinevere performs a thump to the designated place. If she hits enemies, she will knock them airborne by her super magic for 1s and deal 250 (+80% Total Magic Power) points of Magic Damage to them.\nShortly after she uses this skill, she obtains new skill Spatial Migration."
                },
                {
                    "ability_name": "Super Magic",
                    "ability_type": "Passive",
                    "ability_desc": "When Guinevere hits an enemy that is knocked airborne, the damage will be increased by 25%.\nDamage dealt to enemies accumulates super magic, and the next Basic Attack will be enhanced when the magic is full - she performs a chase on the enemy, dealing (+100% Total Physical ATK)(+120% Total Magic Power) points of Magic Damage and recovering 8% of her lost HP."
                },
                {
                    "ability_name": "Energy Wave",
                    "ability_type": "Active",
                    "ability_desc": "Guinevere sends an energy orb to the designated direction, dealing 300 (+130% Total Magic Power) points of Magic Damage to the enemies and slowing them by 50%. Lasts 1.2s. Meanwhile, the CD of her skills are reduced by 1s."
                }
            ]
        },
        {
            "id": 35,
            "hero_name": "Gusion",
            "image": "/images/Gusion.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "119",
                "physical_defense": "18",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2578",
                "mana": "469",
                "attack_speed": "0.89",
                "hp_regen_rate": "39",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Sword Spike",
                    "ability_type": "Active",
                    "ability_desc": "Gusion throws a dagger in the targeted direction, dealing 200 (+50% Total Magic Power) points of Magic Damage to the first target.\nUse Again: Use again to move behind the target and deal 200 (+100% Total Magic Power) points of Magic Damage to them."
                },
                {
                    "ability_name": "Incandescence",
                    "ability_type": "Active",
                    "ability_desc": "Gusion dashes towards the targeted location, immediately reset the CD of Sword Spike and Shadowblade Slaughter.\nUse Again: Use again to dash a short distance in the targeted direction.\nAFter Shadowblade Slaughter being reset, Gusion will be able to immediately throw five daggers and recall ten daggers if the skill is used again."
                },
                {
                    "ability_name": "Dagger Specialist",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Gusion casts a skill, a rune will be added to Gusion's dagger. After stacking 3 runes, the next Basic Attack will deal extra damage equal to 15% of the target's lost HP, and restores HP equal to 80% of the damage dealt."
                },
                {
                    "ability_name": "Shadowblade Slaughter",
                    "ability_type": "Active",
                    "ability_desc": "Gusion throws daggers forward, each dealing 110 (+50% Total Magic Power) points of Magic Damage to targets hit and slowing them for 2s.\nUse Again: Use again to recall daggers, each dealing 65 (+40% Total Magic Power) points of Magic Damage to enemies along the way."
                }
            ]
        },
        {
            "id": 36,
            "hero_name": "Hanabi",
            "image": "/images/Hanabi.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "245",
                "physical_attack": "115",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "17",
                "magic_resistance": "10",
                "hp": "2510",
                "mana": "390",
                "attack_speed": "0.85",
                "hp_regen_rate": "30",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Ninjutsu: Soul Scroll",
                    "ability_type": "Active",
                    "ability_desc": "Hanabi fires the energy scroll in the targeted direction, dealing 400 (+80% Total Physical ATK) points of Physical Damage to enemies along the way and slowing them by 40% for 2s.\nFor each target hit, 140 points of Hanabi's Mana will be srestored. If multiple enemies are hit, the Mana restored from the subsequent enemies will decay."
                },
                {
                    "ability_name": "Forbidden Jutsu: Higanbana",
                    "ability_type": "Active",
                    "ability_desc": "Hanabi throws Higanbana in the targeted direction and Higanbana will fully bloom upon hitting a target, inflicting 400 (+100% Total Physical ATK) points of Physical Damage and 2s of Immobolization on the target. This effect will spread to enemies nearby and each enemy nearby will only be effected once. If the enemy still remains within the range of Higanbana, another Higanbana will bloom, causing the same amount of damage and Immolization Effect again."
                },
                {
                    "ability_name": "Ninjutsu: Equinox",
                    "ability_type": "Passive",
                    "ability_desc": "When Hanabi's HP is full, 50% of HP that would have been granted from Lifesteal is converted into a shield for up to 20% of her Max HP.\nWhen the shield is active, Hanabi is immune to all controls and her Movement Speed is increased by 30 points."
                },
                {
                    "ability_name": "Ninjutsu: Petal Barrage",
                    "ability_type": "Active",
                    "ability_desc": "Passive: Hanabi acquires permanent 8% Physical Lifesteal. For each upgrade of this skill, the Physical Lifesteal increases by 2%.\n\nActive: When the skill is on, for each Basic Attack hit, a new petal blade will be g enerated and shot at the enemies nearby, dealing 50% Physical Damage to them. Each petal blade bounces 3 times in total, the damage dealt decays after each bounce."
                }
            ]
        },
        {
            "id": 37,
            "hero_name": "Hanzo",
            "image": "/images/Hanzo.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "118",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2594",
                "mana": "0",
                "attack_speed": "0.87",
                "hp_regen_rate": "35",
                "mana_regen_rate": "0",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Ninjutsu Demon Feast",
                    "ability_type": "Active",
                    "ability_desc": "Unlocks after five basic attacks. Hanzo uses Ame no Habakiri to devour a target enemy unit and digest them over a period of time. Doing so regenerates Hanzo gets 10 Demon Blood. Can only be used against creeps and minions. Deals 500 points of True Damage if the target is Lord or the Turtle."
                },
                {
                    "ability_name": "Ninjutsu Soul Reap",
                    "ability_type": "Active",
                    "ability_desc": "Hanzo opens the soul portal to deal 160(+60% Total Physical Attack) points of Physical Damage immediately. The portal then cause 40(+15% Total Physical Attack) points of Physical Damage every 0.5 seconds and last 4.5 seconds. Everytime the portal deals damage Hanzo recovers Demon Blood. If Hanzo steps into the center of the portal, he will recover the area and Demon Blood used."
                },
                {
                    "ability_name": "Kinjutsu Pinnacle Ninja",
                    "ability_type": "Active",
                    "ability_desc": "With the help of the Blood Demon, Hanzo becomes the Supreme Demon Ninja and achieves 20 Demon Blood. He then dashes forward to gain 30% movement speed and 30% attack speed. When the Demon Ninja is killed Hanzo will return to where the Blood Demon was, stunned and weakened. If the Blood Demon is killed Hanzo dies too. This skill consumes Demon Blood and once it's used up, the Blood Demon would speed up and get back to Hanzo while stop providing buffs."
                },
                {
                    "ability_name": "Ninjutsu Demon Thorn",
                    "ability_type": "Active",
                    "ability_desc": "Unlocks temporarily after five basic attacks. Hanzo summons the Demon Thorn that is full of Demon Blood Power to attack enemies in a designated direction, dealing 10+500 of the target's Max HP points of Physical Damage to enemies and regenerates Demon Blood. Damage decays when targets are non-hero units."
                },
                {
                    "ability_name": "Ninjutsu Devastator",
                    "ability_type": "Active",
                    "ability_desc": "Hanzo transforms into Demon Pneuma and dashes towards the designated place, dealing 80 (+30% Total Physical Attack) Physical Damage within this area. Unlocks 1 layer of Ninjutsu: Demon Feast. The skill can trigger the bonus effect from Basic Attacks."
                },
                {
                    "ability_name": "Kinjutsu: Pinnacle Ninja",
                    "ability_type": "Active",
                    "ability_desc": "Hanzo becomes the Supreme Demon Ninja and achieves 20 points of Demon Blood. MEanwhile he releases his will together with Ame no Habakiri into the Blood Demon, charging forward and increasing 30% Movement Speed and 30% Attack Speed.\nBlood Demon moves regardless of obstacles. When the Blood Demon is killed, he will return to where Hanzo's body was, stunned for 3s, reduced 50% of his Physical and Magic Defense and exposed himself. When Hanzo's body is killed, Hanzo dies immediately.\nThis skill consumes Demon Blood and once it's used up, Hanzo's body will speed up gradually seeking for Blood Demon and take him back.\nUse Again: Blood Demon gets back to where Hanzo's body is."
                },
                {
                    "ability_name": "Ninjutsu: Soul Reap",
                    "ability_type": "Active",
                    "ability_desc": "Hanzo opens the soul portal to deal 160 (+60% Total Physical ATK) points of Physical Damage immediately. The portal then causes 40 (+15% Total Physical ATK) points of Physical Damage every 0.5s and slows enemies by 30%. Lasts 4.5s. Everytime the portal deals damage, Hanzo recovers Demon Blood.\nIf Hanzo steps into the center of the portal, he will recover the area and get 10 points of Demon Blood used."
                },
                {
                    "ability_name": "Ninjutsu: Demon Feast",
                    "ability_type": "Active",
                    "ability_desc": "Unlocks Temporarily after five Basic Attacks:\nHanzo uses Ame no Habakiri to devour a target enemy unit and digest them over a period of time. By doing so Hanzo gets 10 points of Demon Blood. Can only be used against Creeps and Minions. Deals 500 points of True Damage if the target is the Lord or the Turtle.\n\nIf his Attack Speed reaches 1.5, each attack of Hanzo can unlock 2 stacks."
                },
                {
                    "ability_name": "Ame No Habakiri",
                    "ability_type": "Passive",
                    "ability_desc": "When units are eliminated nearby Hanzo, the Blood Demon absorbs their souls into its body to be used as Demon Blood. Gains 2 points of Demon Blood if it's a non-hero unit and 10 if it's a hero."
                }
            ]
        },
        {
            "id": 38,
            "hero_name": "Harith",
            "image": "/images/Harith.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "114",
                "physical_defense": "19",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2701",
                "mana": "490",
                "attack_speed": "0.84",
                "hp_regen_rate": "36",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Synchro Fission",
                    "ability_type": "Active",
                    "ability_desc": "Harith creates a phantom of himself in the opposite direction and releases Synchro Fission, dealing 120 (+70% Total Magic Power) points of Magic Damage to all enemy units on the path. When the 2 Hariths fuse together, an explosion occur ealing 370 (+210% Total Magic Power) points of Magic Damage to all enemies in the explosion area."
                },
                {
                    "ability_name": "Zaman Force",
                    "ability_type": "Active",
                    "ability_desc": "Harith uses his Key to summon the Zaman Force. When the multidimensional rift appears, the CD of Chrono Dash is reduced by 4s. The rift then slows the nearby enemies by 35% for a period of time. If Harith comes into contact with the rift using Chrono Dash, he will absorb the energy within it, so as to reduce the CD of Synchro Fission/Chrono Dash by 1s/3s respectively."
                },
                {
                    "ability_name": "Key Insight",
                    "ability_type": "Passive",
                    "ability_desc": "Harith gains insight from his Key. He immediately reduces its time controlled up to 60% (dependent on the number of nearby enemy heroes)."
                },
                {
                    "ability_name": "Chrono Dash",
                    "ability_type": "Active",
                    "ability_desc": "Harith dashes towards the designated direction.When he arrives, he steals Magic Attack of nearby enemy heroes, generating a shield that absorbs at least 150 (+150% Total Magic Power) points of damage and enhance the next Basic Attack. Harith's enhanced Basic Attack deals 200 (+80% Total Magic Power) points of Magic Damage and slows enemies by 40%. Hitting an enemy with Harith's enhanced Basic Attack reduces the CD of the next Chrono Dash by 4s."
                }
            ]
        },
        {
            "id": 39,
            "hero_name": "Harley",
            "image": "/images/Harley.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "114",
                "physical_defense": "19",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2501",
                "mana": "490",
                "attack_speed": "0.85",
                "hp_regen_rate": "36",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Poker Trick",
                    "ability_type": "Active",
                    "ability_desc": "Harley shoots 3 rounds of cards forward, dealing 150 (+25% Total Magic Power) points of Magic Damage on first enemy hit by the cards (Damage decays when the same target is hit by 3 times or more) and increasing his Attack Speed by 5% on each hit. Stacks up to 8 times. Lasts 3s."
                },
                {
                    "ability_name": "Magic Master",
                    "ability_type": "Passive",
                    "ability_desc": "As a magic master, his basic attack deals 60 (+50% Total Physical ATK) (+60% Total Magic Power) points of Magic Damage."
                },
                {
                    "ability_name": "Space Escape",
                    "ability_type": "Active",
                    "ability_desc": "Harley blinks to the designated direction, leaving a magic hat at his place, increasing his Movement Speed by 30% for 2s.\n\nUse Again: Use again in 4s to return to where the hat is."
                },
                {
                    "ability_name": "Deadly Magic",
                    "ability_type": "Active",
                    "ability_desc": "Harley shoots a magic fire ring to a designated enemy hero (can be blocked by other heroes), dealing 200 (+60% Total Magic Power) points of Magic Damage and slowing the enemy by 40%. Lasts 1.5s. Generates a huge fire ring around the enemy for 4s. Harley can deal damage by hitting the fire ring with his skills. At the end of its duration, the ring deals 100 (+30% Total Magic Power) points of Magic Damage, plus 50% of damage taken by the target during the skill's duration."
                }
            ]
        },
        {
            "id": 40,
            "hero_name": "Hayabusa",
            "image": "/images/Hayabusa.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "117",
                "physical_defense": "0",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2629",
                "mana": "0",
                "attack_speed": "0.85",
                "hp_regen_rate": "37",
                "mana_regen_rate": "0",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Ougi: Shadow Kill",
                    "ability_type": "Active",
                    "ability_desc": "Hayabusa turns into a shadow and dashes around the battlefield, dealing 5 times of a single-target attack to enemies in an area. Each attack deals 160 (+90% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Ninjutsu: Shadow Heal",
                    "ability_type": "Passive",
                    "ability_desc": "Hayabusa's ninjutsu damage inflicts 1 Shadow Stack. Every stack increases Hayabusa's ninjutsu damage by 5%."
                },
                {
                    "ability_name": "Quad Shadow",
                    "ability_type": "Active",
                    "ability_desc": "Hayabusa moves in a designated direction and releases a phantom behind him. If he hits an enemy in the path, he will stop immediately and release 3 phantoms that travel in different directions. When phantoms hit enemy heroes, they will seep into them, deal 130 (+30% Total Physical ATK) points of Physical Damage and slow them by 40%. Lasts 2s.\nUse again: Hayabusa can move to a phantom's location. IF that phantom happens to be in an enemy hero, Hayabusa will deal an extra 130 (+30% Total Physical ATK) points of Physical Damage to them. Every time Hayabusa moves using Quad Shadow, the CD for Shuriken will be reduced by 1s."
                },
                {
                    "ability_name": "Phantom Shuriken",
                    "ability_type": "Active",
                    "ability_desc": "Hayabusa throws three shurikens forward that will travel back to him after flying a certain distance. Each shuriken deals 170 (+70% Total Physical ATK) points of Physical Damage to enemies, slows them and recover Hayabusa 10 points of energy. Damage and regenerative effects of this skill decay over time. \n\nEvery level of this skill will grant Hayabusa extra 3% Spell Vamp."
                }
            ]
        },
        {
            "id": 41,
            "hero_name": "Helcurt",
            "image": "/images/Helcurt.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "121",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2559",
                "mana": "440",
                "attack_speed": "0.87",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Shadow Raid",
                    "ability_type": "Active",
                    "ability_desc": "Vanishes right away and appears at a target location, dealing 150 (70% Total Physical ATK) [C3physical damage] to nearby enemies and silencing them for 1.5s. Using after Dark Night Falls will also inflict an extra slow effect on enemies that lasts 1.5s."
                },
                {
                    "ability_name": "Deadly Poisoned Stinger",
                    "ability_type": "Active",
                    "ability_desc": "Active: Fires his Deadly Poisoned Stingers forward, each stinger deals 200 (+100% extra physical ATK) [C3physical damage] (minions and jungle monsters only take 70% of the damage), slowing the enemy by 12% (Effect stacks) for 3s. Passive: Each basic attack increases one Deadly Poisoned Stinger, it stores up to 5 stingers and lasts 8s."
                },
                {
                    "ability_name": "Shadow Transition",
                    "ability_type": "Active",
                    "ability_desc": "Helcurt teleports to the target location and deals 150 (+70% Total Physical ATK) points of Physical Damage to enemies within the area, silencing them for 1.5s.\nUsing this skill after Dark Night Falls will also inflict an extra Slow Effect of 40% on enemies for 1.5s."
                },
                {
                    "ability_name": "Deadly Stinger",
                    "ability_type": "Active",
                    "ability_desc": "Passive: Each Basic Attack grants Helcurt one Deadly Poison Stinger. Up to 5 stingers can be stored. Effect lasts for 8 seconds, after which the number of stingers decrease over time.\n\nActive: Helcurt fire Deadly Poison Stingers forward, each dealing 250 (+100% Total Physical ATK) points of Physical Damage to enemies (Minions and Creeps only take 70% of potential damage) and slowing them by 8% (the effect stacks) for 3s."
                },
                {
                    "ability_name": "Dark Night Falls",
                    "ability_type": "Active",
                    "ability_desc": "Passive: Permanently increases Attack Speed by 10%.\n\nActive: Helcurt summons the night, reducing the vision range of all enemy heroes and depriving their sight of allies for 3.5s, while increasing his own Attack Speed by 10% and Movement Speed by 65% for 8s. During the night, the number of stingers stored won't decrease. (Dark Night Falls has no effect on Helcurt when used by an enemy)."
                },
                {
                    "ability_name": "Race Advantage",
                    "ability_type": "Passive",
                    "ability_desc": "Targets casting skills around Shadowbringer are silenced for 1.5s if their skills deal damage to him. This effect has a CD of 4s on one target."
                }
            ]
        },
        {
            "id": 42,
            "hero_name": "Hilda",
            "image": "/images/Hilda.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "260",
                "physical_attack": "123",
                "physical_defense": "24",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2709",
                "mana": "0",
                "attack_speed": "0.84",
                "hp_regen_rate": "42",
                "mana_regen_rate": "0",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Power of Wilderness",
                    "ability_type": "Active",
                    "ability_desc": "Hilda jumps toward the target and slashes powerfully, dealing 700 (+200 % Total Physical ATK) Physical Damage and temporarily stunning the target. Nearby enemies also take 60% of this skill damage.\nEach kill or assist enhances Power of Wilderness, increasing its Physical Damage by 40, stacking up to 10 times. Damage will increase by 80 and ignore 60% of the target's Physical Defense at full stacks."
                },
                {
                    "ability_name": "Blessing of Wilderness",
                    "ability_type": "Passive",
                    "ability_desc": "When entering the bush, Hilda's HP Regeneration Speed increases and she gains a shield for 5s, which absorbs damage equal to 10% of her Max HP. This effect can only be triggered every 10s.\n\nWhen Hilda's HP drops below 30%, she gains greatly enhanced HP regen effect. Recovers 30% of her Max HP within 5s. This effect can only be triggered every 120s."
                },
                {
                    "ability_name": "Combat Ritual",
                    "ability_type": "Passive",
                    "ability_desc": "Hilda activates the runic power of the great sword, increasing her Movement Speed by 60% for 3s and enhancing her next Basic Attack: it deals 200 (+100% Total Physical ATK) points ofPhysical Damage and slows the target by 70%. Lasts 3s. It also deals 120 (+60% Total Physical ATK) Physical Damage to enemies behind the target."
                },
                {
                    "ability_name": "Art of Hunting",
                    "ability_type": "Active",
                    "ability_desc": "Hilda locks onto an enemy target, each time dealing 120 (+100 % Total Physical ATK) points of Physical Damage. Skill can be released 3 times at most. The 2nd attack will deal damage to target's surroundings, and the 3rd attack will knock back the target and surrounding enemies temporarily."
                }
            ]
        },
        {
            "id": 43,
            "hero_name": "Hylos",
            "image": "/images/Hylos.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "105",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "3309",
                "mana": "430",
                "attack_speed": "430",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Glorious Pathway",
                    "ability_type": "Active",
                    "ability_desc": "Hylos creates a pathway for 6s. He recovers 4% of Max HP and is immune to Slowing Effect while on the pathway. Allies moving towards the pathway will have their Movement Speed increased by 60%, enemies moving away from the pathway will have their Movement Speed Reduced by 70%."
                },
                {
                    "ability_name": "Thickened Blood",
                    "ability_type": "Passive",
                    "ability_desc": "Hylos gains extra 1.5 points of Max HP when gaining every 1 points of Max Mana from Equipments and Emblems.\nWhen Mana is not enough, HP can be used to cast skills instead."
                },
                {
                    "ability_name": "Ring of Punishment",
                    "ability_type": "Active",
                    "ability_desc": "Hylos releases the Ring of Punishment, every second dealing to surrounding enemies 95 (+20% Total Magic Power) points of Magic Damage and slowing them by 6% and Attack Speed by 5%. Stacks up to 10 times. Each stack lasts 2.5s and increaes 7.5% damage of Ring of Punishment. Ring of Punishment will continuously use 30 points of Mana when its active.\n\nUse Again: Hylos stops releasing Ring of Punishment."
                },
                {
                    "ability_name": "Law and Order",
                    "ability_type": "Active",
                    "ability_desc": "Hylos stores nature's energy to lock down the target and deals 300 (+80 % Total Magic Power) points of Magic Damage and stuns the target for 1s."
                }
            ]
        },
        {
            "id": 44,
            "hero_name": "Irithel",
            "image": "/images/Irithel.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "250",
                "physical_attack": "110",
                "physical_defense": "17",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2540",
                "mana": "438",
                "attack_speed": "0.83",
                "hp_regen_rate": "35",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Jungle Heart",
                    "ability_type": "Passive",
                    "ability_desc": "Irithel and Leo know each other so well that allows her to shoot while moving. Each Basic Attack shoots out 3 heavy arrows (it takes a while to reload the heavy bow), each arrow deals 42% of Physical Damage (only the first arrow can trigger equipment passive abiltiies)."
                },
                {
                    "ability_name": "Force of the Queen",
                    "ability_type": "Active",
                    "ability_desc": "Leo shouts loudly, dealing 200 (+60% Total Physical ATK) points of Physical Damage to the enemies in the area and slowing them by 80% for 2s."
                },
                {
                    "ability_name": "Heavy Crossbow",
                    "ability_type": "Active",
                    "ability_desc": "Irithel controls Leo to jump forward and equips a heavy crossbow, after which her Basic Attack will deal 80 (+126% Total Physical ATK) points of Physical Damage to a target and nearby enemies for 15s."
                },
                {
                    "ability_name": "Strafe",
                    "ability_type": "Active",
                    "ability_desc": "Irithel shoots a round of arrows, dealing 250 (+60% Total Physical ATK) points of Physical Damage to the enemies in the area and reducing their Physical Defense by 15 for 3s."
                }
            ]
        },
        {
            "id": 45,
            "hero_name": "Jawhead",
            "image": "/images/Jawhead.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "119",
                "physical_defense": "24",
                "magic_power": "0",
                "armor": "0",
                "magic_resistance": "10",
                "hp": "2778",
                "mana": "430",
                "attack_speed": "0.9",
                "hp_regen_rate": "39",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Mecha Suppression",
                    "ability_type": "Passive",
                    "ability_desc": "Each time you deal damage to a target, you inflict it with a stack of Compression for 3s (up to 10 stacks). Each stack of Compression increases the amount of basic attack damage Jawhead deals to the target by 8%"
                },
                {
                    "ability_name": "Smart Missiles",
                    "ability_type": "Active",
                    "ability_desc": "Body-mounted missiles enter launch state for 5s, randomly firing up to 12 missiles at nearby targets. Each attack deals 80(+20% Total Physical ATK) [C3physical damage]."
                },
                {
                    "ability_name": "Mecha Supression",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Jawhead deals damage to a target, he inflicts a stack of Compression on it for 3s (stacks up to 10 times). Each stack of Compression increases the amount of Basic Attack damage Jawhead deals to the target by 8%."
                },
                {
                    "ability_name": "Smart Missles",
                    "ability_type": "Active",
                    "ability_desc": "Jawhead's body-mounted missles enter Launch State for 5s, randomly firing up to 12 missles at nearby targets. Each deals 80 (+20% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Ejector",
                    "ability_type": "Active",
                    "ability_desc": "Jawhead enters Fling State, gaining 30% of Movement Speed and a shield tha sborbs up to 600 (+100% Total Physical ATK) damage for 5s.\nUsing this skill again throws his closest target to a designated location, dealing 300 (+80% Total Physical ATK) points of Physical Damage and stunning the target and enemies in the area for 0.5s. (Prioritizes heroes. Can be used on tammates, but they won't take damage)."
                },
                {
                    "ability_name": "Unstoppable Force",
                    "ability_type": "Active",
                    "ability_desc": "Jawhead locks onto an enemy hero, charging into them and stunning them briefly, while knocking back enemy units around the target. Deals 400 (+100% Total Physical ATK) points of Physical Damage to the initial target and the units surrounding them."
                }
            ]
        },
        {
            "id": 46,
            "hero_name": "Johnson",
            "image": "/images/Johnson.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "movement_speed": "255",
                "physical_attack": "112",
                "physical_defense": "27",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2809",
                "attack_speed": "10.33",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Electromag Rays",
                    "ability_type": "Active",
                    "ability_desc": "Johnson raises his shield, continuously dealing 80 (+20% Total Physical DEF) points of Magic Damage forwards in a fan-shape range and slowing enemies.\n\nWhile holding the shield, Johnson can cast Basic Attack and skills."
                },
                {
                    "ability_name": "Rapid Touchdown",
                    "ability_type": "Active",
                    "ability_desc": "Passive: Permanently Increases Physical Defense by 10%.\nJohnson jumps up and transforms into a car, accelerating over time. Only 1 teammate can get in the car when it's moving slowly, and then they will rush forward along with Johnson. The car will explode upon hitting an enemy hero, stunning the target and nearby enemies for 0.5s-1s, and dealing 300 (+90% Total Magic Power) - 750 (+225% Total Magic Power) Magic Damage according to the car's speed. After the explosion, the ground will be electrified, slowing enemies and dealing 80 (+20% Total Magic Power) Magic Damage to those who are in the area. When the car is going slowly, tap the skill Throttle again to move faster. Tap the skill Brake to stop immediately."
                },
                {
                    "ability_name": "Electro-airbag",
                    "ability_type": "Passive",
                    "ability_desc": "When John's HP is lower than 30%, he generates a shield that absorbs 300 (+700% Total Physical DEF) points of damage for 10s.\n\nThis effect has a CD of 100s."
                },
                {
                    "ability_name": "Deadly Pincers",
                    "ability_type": "Active",
                    "ability_desc": "Johnson throws a spanner in the designated direction that deals 200 (+150% Total Physical DEF) points of Magic Damage to enemies in its path. Enemies in the area that the spanner lands will be stunned by 0.8s."
                }
            ]
        },
        {
            "id": 47,
            "hero_name": "Kadita",
            "image": "/images/Kadita.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "105",
                "physical_defense": "18",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2491",
                "mana": "495",
                "attack_speed": "0.8",
                "hp_regen_rate": "34",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Breath Of The Ocean",
                    "ability_type": "Active",
                    "ability_desc": "Kadita summons an ocean wave to mark a designated are. After a period of time, the wave surges out of the ground to deal 350(+140% Total Magic Power) points of Magic Damage and knocks an enemy into the air for 1.5s. Kadita can cast this skill during Ocean Oddity. By doing so, she releases it at the place she stands at and the waves surge out faster."
                },
                {
                    "ability_name": "Breath of the Ocean",
                    "ability_type": "Active",
                    "ability_desc": "Kadita summons an ocean wave to mark a designated area. After a period of time, the wave surges out of the ground to deal 350 (+140% Total Magic Power) points of Magic Damage and knocks an enemy into the air for 1.5s.\nKadita can cast this skill during Ocean Oddity. By doing so, she releases Brath of the Ocean at the place she stands and the waves surge out faster."
                },
                {
                    "ability_name": "Ocean Oddity",
                    "ability_type": "Active",
                    "ability_desc": "Kadita becomes a mermaid and summons and ocean wave. She then rides on the wave, dealing 265 (+90% Total Magic Power) points of Magic Damage and slows enemies by 30%. She gains immunity to all crowd control skills and reduces 70% damage taken when she in inside the waves. \nUse Again: She will immediately get off the wave, then the wave would travel itself in the current direction. This skill ignores obstacles."
                },
                {
                    "ability_name": "Rough Waves",
                    "ability_type": "Active",
                    "ability_desc": "With the might of the ocean at her command, Kadita summons a tsunami to crush nearby enemies. Each wave deals 300 (+60% Total Magic Power) points of Magic Damage and slows them by 25%. The more waves an enemy takes, the more damage they take. The tsunami then returns to her and deals 200 (+40% Total Magic Power) points of Magic Damage to enemies on the path (The damage decays when hitting the same enemy hero for multiple times)."
                },
                {
                    "ability_name": "Thalassophobia",
                    "ability_type": "Passive",
                    "ability_desc": "Every 30s, Kadita receives Blessing from the Might of the Ocean. In 4s after taking Damage, she regenerates 65% of HP lost within the skill's duration."
                }
            ]
        },
        {
            "id": 48,
            "hero_name": "Kagura",
            "image": "/images/Kagura.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "118",
                "physical_defense": "19",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2556",
                "mana": "519",
                "attack_speed": "0.82",
                "hp_regen_rate": "35",
                "mana_regen_rate": "21",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Seimei Umbrella Open",
                    "ability_type": "Active",
                    "ability_desc": "Kagura moves Seimei Umbrella to the designated area, dealing 330 (+150% Total Magic Power)  points of Magic Damage to enemies along thje way and slowing them by 60%. Lasts 1s."
                },
                {
                    "ability_name": "Rasho Umbrella Flee",
                    "ability_type": "Active",
                    "ability_desc": "With Seimei Umbrella, Kagura removes all Debuffs on her and moves in a designated direction, leaving the Umbrella behind."
                },
                {
                    "ability_name": "Yin Yang Overturn",
                    "ability_type": "Active",
                    "ability_desc": "With Seimei Umbrella, Kagura deals 260 (+120% Total Magic Power) points of Magic Damage, knocking back nearby enemies and slowing them by 65% for 1s."
                },
                {
                    "ability_name": "Yin Yang Gathering",
                    "ability_type": "Passive",
                    "ability_desc": "When Kagura takes Seimei Umbrella, she will gain a shield that absorbs up to 280 (+50% Total Magic Power) damage, stunning nearby enemies for 0.5s and slowing them by 60%. Lasts 2s. This effect only activates every 4.5s."
                }
            ]
        },
        {
            "id": 49,
            "hero_name": "Kaja",
            "image": "/images/Kaja.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "270",
                "physical_attack": "120",
                "physical_defense": "30",
                "magic_resistance": "10",
                "hp": "2609",
                "mana": "400",
                "attack_speed": "0.84",
                "hp_regen_rate": "52",
                "mana_regen_rate": "12",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Eye of the Storm",
                    "ability_type": "Passive",
                    "ability_desc": "Kaja gains 40% movement speed when attacked by enemy heroes. This movement speed boost decays over 1 seconds and can be triggered once every 5 seconds."
                },
                {
                    "ability_name": "Gale Force",
                    "ability_type": "Active",
                    "ability_desc": "Charges in a specified direction, Dealing 260(+80%Total Magic Power) [C1magic damage] to enemies in his path. When encountering a friendly hero along the way, this dash will be immediately interrupted and the encountered teammate will be granted a shield. Can be used again within 10% seconds to move again in a specified direction."
                },
                {
                    "ability_name": "Lightning Bomb",
                    "ability_type": "Active",
                    "ability_desc": "Kaja moves towards the designated direction and leaves 3 lightning bombs along the way. When enemy units touch the lighting bombs, they will take 200 (+80% Total Magic Power) points of Magic Damage."
                },
                {
                    "ability_name": "Wrath Sanction",
                    "ability_type": "Passive",
                    "ability_desc": "Kaja achieves Wrath Sanction every 6s. His next Basic Attack will send a lighting to enemies, dealing Magic Damage equal to 150 (+70% Total Magic Power) points plus 5% of the target's Max HP. The lightning will hit enemies nearby as well (up to 3 times)."
                },
                {
                    "ability_name": "Ring of Order",
                    "ability_type": "Active",
                    "ability_desc": "Kaja releases a Ringed Electric Blade that quickly expands and contracts. Any enemy target will recieve 150 (+70% Total Magic Power) points of Magic Damage and experience a temporary speed reduction of 30%. Lasts 1s.\nEach damage dealt to the enemy units will reduce the CD of Wrath Sanction by 1s."
                },
                {
                    "ability_name": "Divine Judgment",
                    "ability_type": "Active",
                    "ability_desc": "Kaja deals 360 (+150% Total Magic Power) points of Magic Damage to a designated enemy hero and suppresses the target for 1.5s.\n\nDuring that time, the enemy hero's Magic Defense is reduced by 10. Kaja absorbs 2x of the target enemy's lost Magic Defense."
                }
            ]
        },
        {
            "id": 50,
            "hero_name": "Karina",
            "image": "/images/Karina.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "121",
                "physical_defense": "20",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2633",
                "attack_speed": "0.9",
                "hp_regen_rate": "431",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Dance of Death",
                    "ability_type": "Active",
                    "ability_desc": "Karina brandishes her double swords, dealing 260 (+130% Total Magic Power) points of Magic Damage to surrounding enemies. \n\nKills or Assists will reduce this skill's CD by 60%."
                },
                {
                    "ability_name": "Shadow Transition",
                    "ability_type": "Active",
                    "ability_desc": "Karina rapidly rushes towards a target, dealing 430 (+220% Total Magic Power) points of Magic Damage.\n\nKills will immediately reset this skill's CD while Assists will reduce the CD by 80%."
                },
                {
                    "ability_name": "Combo Hit",
                    "ability_type": "Passive",
                    "ability_desc": "After attacking a target twice continuously, Karina's third attack will deal extra True Damage to the target that equals to 10% of the enemy's lost HP."
                },
                {
                    "ability_name": "Elusiveness",
                    "ability_type": "Active",
                    "ability_desc": "Karina enters Elusiveness State for 3s, becoming immune to all Basic Attacks and speeding up by 35%. Her next Basic Attack will let her cast off Elusiveness State and deal extra 165 (+75% Total Magic Power) points of Magic Damage with Crit Damage. Target will be slowed by 40%. Lasts 2s.\n\nKills or Assists will reduce this skill's CD by 60%."
                }
            ]
        },
        {
            "id": 51,
            "hero_name": "Karrie",
            "image": "/images/Karrie.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "diamond_cost": "499",
                "movement_speed": "240",
                "physical_attack": "112",
                "physical_defense": "17",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2498",
                "mana": "440",
                "attack_speed": "0.84",
                "hp_regen_rate": "40",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Phantom Step",
                    "ability_type": "Active",
                    "ability_desc": "Karrie moves towards a designated direction while releasing a lightwheel to the most nearby enemy, dealing 150 (+70% Total Physical ATK) points of Physical Damage and adding Lightwheel Mark. \nAfter entering Dual Wield Mode, she will release 2 lightwheels."
                },
                {
                    "ability_name": "Spinning Lightwheel",
                    "ability_type": "Active",
                    "ability_desc": "Karrie releases flywheels and deals 200 (+90% Total Physical ATK) points of Physical Damage on the path. When the flywheels go to the end, they deal 100 (+20% Total Physical ATK) points of Physical Damage to nearby enemies and slow them by 80% continously. Lasts 1s."
                },
                {
                    "ability_name": "Lightwheel Mark",
                    "ability_type": "Passive",
                    "ability_desc": "Karrie adds a Lightwheel Mark to enemies with each Basic Attack or Skill. When Lightwheel Mark stacks to 5 marks on a target, the mark becomes actual lightwheels, piericng the target and dealing True Damage equal to 7-13% of target's Max HP. Damage against Creeps is no more than 300."
                },
                {
                    "ability_name": "Speedy Lightwheel",
                    "ability_type": "Active",
                    "ability_desc": "Karrie enters Dual Wield Mode. Within the next 6s, her Movement Speed will be increased by 20%. Releases 2 lightwheels on each Basic Attack, but each Basic Attack only deals 50% damage and her Attack Speed is reduced by 20%."
                }
            ]
        },
        {
            "id": 52,
            "hero_name": "Khufra",
            "image": "/images/Khufra.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "117",
                "physical_defense": "19",
                "magic_power": "0",
                "magic_resistance": "0",
                "hp": "2709",
                "mana": "460",
                "attack_speed": "0.79",
                "hp_regen_rate": "47",
                "mana_regen_rate": "15",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Tyrants Range",
                    "ability_type": "",
                    "ability_desc": "Khufra pulls back all enemy targets around him toward the front, dealing 300(+100%Total Physical Attack) points of Physical Damage and slowing them down for 1.25 seconds. If the enemies are knocked against walls, an extra Physical Damage equals to 150% of this skill's damage will be inflicted upon them, and they will be stunned, instead of slowed."
                },
                {
                    "ability_name": "Tyrant's Rage",
                    "ability_type": "Active",
                    "ability_desc": "Khufra pulls back all enemy htargets around him towards his front, dealing 300 (+100% Total Physical ATK) points of Physical Damage and slowing them down for 1.25s. If the enemies are knocked against walls, extra Physical Damage equal to 150% of this skill's damage will be inflicted upon them, and they will be stunned instead of slowed."
                },
                {
                    "ability_name": "Tyrant's Revenge",
                    "ability_type": "Active",
                    "ability_desc": "Khufra pulls the bandage on his arms to launch himself in the specified direction, dealing Physical Damage equal to 80 plus 10(+1.5% Total Physical ATK)% of his MAx HP to all enemy units on the path. When blinking to the furthest distance or encountering a first enemy hero, Khufra will immediately stop, dealing Physical Damage equal to 80 plus 10(+1.5% Total Physical ATK) of his Max HP to enemies nearby and then knocking them in the air for up to 1.1s."
                },
                {
                    "ability_name": "Bouncing Ball",
                    "ability_type": "Active",
                    "ability_desc": "Khufra uses his bandage to wrap himself into a magic bouncing ball, increasing his own Physical and Magic Defense by 75%. Enemies trying to use blink skills to move across Khufra will be knocked airborne. Each time the magic bouncing ball hits the ground, it will deal Magic Damage equal to 30 plus 6(+2% Total Physical ATK)% of his Max HP to enemies nearby and slow them by 80%. Lasts 0.5s."
                },
                {
                    "ability_name": "Spell Curse",
                    "ability_type": "Passive",
                    "ability_desc": "Khufra activates the Spell Curse left by Esmeralda every 12s to increase the range of the Next Basic Attack, dealing Magic Damage equal to (+120% Total Physical ATK) plus 8% of his Max HP to and slowing them by 30%. Lasts 1.5s. MEanwhile, Khufra restores 8% of his Max HP.\nEach time Khufra uses his skills to control any enemy heroes, the CD of Spell Curse will be reduced by 4s."
                }
            ]
        },
        {
            "id": 53,
            "hero_name": "Kimmy",
            "image": "/images/Kimmy.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "245",
                "physical_attack": "104",
                "magic_power": "0",
                "armor": "22",
                "magic_resistance": "10",
                "hp": "2450",
                "mana": "100",
                "attack_speed": "0.826",
                "hp_regen_rate": "40",
                "mana_regen_rate": "0",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Maximum Charge",
                    "ability_type": "Active",
                    "ability_desc": "Kimmy creates a Luminious Chemical Attacks after charging. Kimmy's Luminescent Attack travel a certain dsitance, dealing 238 (+180% Total Physical ATK)(+210% Total Magic Power) points of Magic Damage to enemy units and 198 (+150% Total Physical ATK)(+170% Total Magic Power) points of Magic Damage to enemies nearby.\nRegenerate 30 points of energy if Kimmy hits a target with this skill."
                },
                {
                    "ability_name": "Chemist's Instinct",
                    "ability_type": "Passive",
                    "ability_desc": "Kimmy can move and aim at other directions when using her Spray Gun, but is often less accurate. Her Spray Gun will only enjoy 50% of Physical Lifesteal.\nAll the buffs on Attack Speed will be converted to Movement Speed for her."
                },
                {
                    "ability_name": "Chemical Refinement",
                    "ability_type": "Active",
                    "ability_desc": "Kimmy Shoots out the enhanced Chemical Spray and the recoil in turn pushes her backwards for a certain distance. The spray then falls down to the ground and increates contaminated areas. Enemies who walk on these areas will take 14 (+30% Total Physical ATK)(+40% Total Magic Power) points of Magic Damage every 0.5s and becoming slowed by 40%.\nRegenerates 40 points of energy using this skill."
                },
                {
                    "ability_name": "Energy Transformation",
                    "ability_type": "Active",
                    "ability_desc": "Kimmy's Basic Attack will be changed into chemical Ball. Each Chemical Ball deals 19 (+40% Total Physical ATK)(+45% Total Magic Power) points of Magic Damage. If Kimmy fails to hit a target, the Chemical explodes upon travelling a certain distance, and deals the same damage to nearby enemies. This skill enjoys only 40% of Spell vamp.\n\nUse Again: Return to normal Basic Attack."
                }
            ]
        },
        {
            "id": 54,
            "hero_name": "Lancelot",
            "image": "/images/Lancelot.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "32000",
                "movement_speed": "260",
                "physical_attack": "124",
                "physical_defense": "16",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2549",
                "mana": "450",
                "attack_speed": "0.87",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Puncture",
                    "ability_type": "Active",
                    "ability_desc": "Lancelot charges towards the designated direction, dealing 100 (+60% Total Physical ATK) points of Physical Damage. The target will be etched with a sword mark. If the target doesn't have a sword mark, then the CD of this skill will be reset."
                },
                {
                    "ability_name": "Phantom Execution",
                    "ability_type": "Active",
                    "ability_desc": "After a short period of charging, Lancelot perforams an executioner's strike in a forward direction. He is invinicible throughout the process, dealing 400 (+150% Total Physical ATK) points of Physical Damage to his enemies."
                },
                {
                    "ability_name": "Thorned Rose",
                    "ability_type": "Active",
                    "ability_desc": "Lancelot performs an amazing sword tecinique within an area that may strike enemies up to 3 times, dealing 250 (+100% Total Physical ATK) points of Physical Damage (Damage will be reduced for each extra struck target) and slowing enemies by 0.5s for each hit. This slow effect can stack. This skill only gets 40% Spell Vamp."
                },
                {
                    "ability_name": "Soul Cutter",
                    "ability_type": "Passive",
                    "ability_desc": "For every 10s (affected by CD Reduction), Lancelot's next Basic Attack will take Defense away from enemies or Creeps. Lancelot deals extra 20% damage to those whose Defense are taken. Lasts 6s. When enemies move to where they have lost their Defence, they can get their Defense back."
                }
            ]
        },
        {
            "id": 55,
            "hero_name": "Lapu-Lapu",
            "image": "/images/Lapu-Lapu.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "119",
                "armor": "21",
                "magic_resistance": "10",
                "hp": "2628",
                "attack_speed": "0.9",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Hero's Faith",
                    "ability_type": "Passive",
                    "ability_desc": "Lapu-Lapu will gain a stack of Bravery Blessing after hitting an enemy hero or a Creep with his skills. After gaining 5 stacks, Lapu-Lapu's next Basic Attack will deal extra 250% damage (not critical). It will also give Lapu-Lapu a shield that absorbs 500-1200 points of damage. (Scales with level)."
                },
                {
                    "ability_name": "Justice Blade",
                    "ability_type": "Active",
                    "ability_desc": "Lapu-Lapu hurls two boomeranging blades of light forward. Each blade deals 120 (+50% Total Physical ATK) points of Physical Damage to enemies hit on their way out and back, and multiple hits on the same enemy only grant 1 stack of Bravery Blessing."
                },
                {
                    "ability_name": "Brace Stance",
                    "ability_type": "Active",
                    "ability_desc": "Lapu-Lapu charges with his twin blades, dealing 100 (+50% Total Physical ATK) points of Physical Damage to enemies on the path.\nIf he hits an enemy hero, his Movement Speed will be increased by 30%. Lasts 3s."
                },
                {
                    "ability_name": "Chieftain's Rage",
                    "ability_type": "Active",
                    "ability_desc": "Lapu-Lapu combines twin blades into one heavy sword and slashes forward, dealing 400 (+200% Total Physical ATK) points of Physical Damage to enemies, stunning them for 0.8s. He then increases 30 Physical and Magic Defense of his own within 15s. Lapu-Lapu enters Heavy Sword state and enhances all his skills. Lasts for 15s."
                }
            ]
        },
        {
            "id": 56,
            "hero_name": "Layla",
            "image": "/images/Layla.jpg",
            "stats": {
                "battle_point_cost": "0",
                "diamond_cost": "0",
                "movement_speed": "240",
                "physical_attack": "130",
                "physical_defense": "15",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2500",
                "mana": "424",
                "attack_speed": "0.85",
                "hp_regen_rate": "27",
                "mana_regen_rate": "14",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Malefic Bomb",
                    "ability_type": "Active",
                    "ability_desc": "Layla fires a Malefic Energy Bomb forward, dealing 200 (+80% Total Physical ATK) points of Physical Damage to the first enemy hit. Malefic Energy Bomb enjoys Crit Effect."
                },
                {
                    "ability_name": "Void Projectile",
                    "ability_type": "Active",
                    "ability_desc": "Layla fires an energy ball that explodes, dealing 170 (+65% Total Physical ATK) points of Physical Damage to the target and nearby enemies, slowing them by 40% for 2s. The skill range scales with levels."
                },
                {
                    "ability_name": "Malefic Gun",
                    "ability_type": "Passive",
                    "ability_desc": "Layla's damage of basic attacks and skills scales with distance between her and enemies, from 100% up to 130%."
                },
                {
                    "ability_name": "Destruction Rush",
                    "ability_type": "Active",
                    "ability_desc": "Layla fires an energy cannon, dealing 500 (+150% Total Physical ATK) points of Physical Damage to enemies in front of her. Building this skill also increases her basic attack range by 0.4 points."
                }
            ]
        },
        {
            "id": 57,
            "hero_name": "Leomord",
            "image": "/images/Leomord.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "128",
                "physical_defense": "25",
                "magic_resistance": "10",
                "hp": "2738",
                "attack_speed": "0.844",
                "hp_regen_rate": "35",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Phantom Stomp",
                    "ability_type": "Active",
                    "ability_desc": "Barbiel leaps forward, dealing 375(+100% Total Physical Attack) points of Physical Damage to enemy units in the area where he lands, slowing them by 60%."
                },
                {
                    "ability_name": "Phantom Charge",
                    "ability_type": "Active",
                    "ability_desc": "Barbiel charges forward and knocks back all enemies in the lane. Deals 300(+50% Total Physical Attack) points of Physical Damage."
                },
                {
                    "ability_name": "Momentum",
                    "ability_type": "Active",
                    "ability_desc": "Leomord immediately gains a shield that absorbs 150 (+150% Total Magic Power% Total Physical ATK) points of Physical Damage and can charge his attack. He then deals 360 (+140% Total Physical ATK) points of Physical Damage and slows enemy units by 40% within the area. Lasts 1s.\nUse Again: The longer Leomord charges this skill, the higher its damage. Any actions that interrupt, Leomord's charge automatically trigger the attack."
                },
                {
                    "ability_name": "Phantom Steed",
                    "ability_type": "Active",
                    "ability_desc": "Leomord calls for Barbiel to rush into the battlefield and knock back all enemies in its way. Barbiel deasl 350 (+100% Total Physical ATK) points of Physical Damage to enemy units in his path, slowing them by 35%. Lasts 1s.\nIf Barbiel comes in cotnact with Leomord, they will enter a mounted state.\nMounted State: Leomord gains a whole new set of skills. He can use Basic Attacks writhin a circular area, even whiling moving, Additionally, Leomord increases his Movement Speed by 60 points and Physical/Magical Defense by 40 points."
                },
                {
                    "ability_name": "Decimation Assault",
                    "ability_type": "Active",
                    "ability_desc": "Leomord quickly charge towards a designated direction, dealing 300 (+50% Total Physical ATK) points of Physical Damage to enemies near his path and destination. Slows enemy units by 30%. Lasts 1s."
                },
                {
                    "ability_name": "The Oath Keeper",
                    "ability_type": "Passive",
                    "ability_desc": "If target's HP is lower than 30%, Leomord deals critical damage."
                }
            ]
        },
        {
            "id": 58,
            "hero_name": "Lesley",
            "image": "/images/Lesley.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "115",
                "physical_defense": "14",
                "magic_resistance": "10",
                "hp": "2490",
                "attack_speed": "0.826",
                "hp_regen_rate": "36",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Lethal Shoot",
                    "ability_type": "Passive",
                    "ability_desc": "Hitting an enemy with a basic attack grants 5 energy. If Lesley doesn't take damage for 5s, her next basic attack has a longer range, 40% crit chance and deals x1.3 damage. Using any skill will reset Lethal Shot's cooldown. Each fixed point of Physical Penetration Lesley obtains will be converted into 1% additional crit rate. (Physical penetration percentage is not affected)."
                },
                {
                    "ability_name": "Lethal Shot",
                    "ability_type": "Passive",
                    "ability_desc": "Hitting an enemy with a Basic Attack grants Lesley 5 points of Energy. If Lesley doesn't take damage for 5s, her next Basic Attack has a longer range and 40% Crit Rate with 1.3x damage.\nUsing any skill will reset the CD of Lethal Shot.\nEach point of Physical Penetration Lesley obtains will be converted into 1% extra Crit Rate. (Physical Penetration is not affected)."
                },
                {
                    "ability_name": "Tactical Grenade",
                    "ability_type": "Active",
                    "ability_desc": "Lesley throws a tactical grenade forward, which explodes in a fan-shaped area in front of her, dealing 150 (+50% Total Physical ATK) points of Physical Damage to enemies and knocking them back. Meanwhile Lesley jumps back slightly.\nUsing this skill will instantly cancel Ultimate Snipe and release a fatal bullet. (Extra attacks will only be launched if fatal bullets have not finished firing.)"
                },
                {
                    "ability_name": "Master of Camouflage",
                    "ability_type": "Active",
                    "ability_desc": "Lesley enters the Camouflage State for 3s, increasing Movement Speed by 30% and Physical Attack by 50. \nDealing or taking damage will end the state. Enemies can detect Lesley's camouflage throug distortions of their surroundings."
                },
                {
                    "ability_name": "Ultimate Snipe",
                    "ability_type": "Active",
                    "ability_desc": "Lesley locks onto an enemy hero and fires 4 fatal bullets, dealing 200 (+80% Total Physical ATK) plus 5% of the target's lost HP as Physical Damage. Each bullet that hits a target grants her 10 points of Energy. (Bullets can be blocked by other enemy heroes)."
                }
            ]
        },
        {
            "id": 59,
            "hero_name": "Ling",
            "image": "/images/Ling.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "119",
                "physical_defense": "18",
                "magic_resistance": "10",
                "hp": "2578",
                "mana": "0",
                "attack_speed": "0.89",
                "hp_regen_rate": "39",
                "mana_regen_rate": "0",
                "category": "Assassin"
            },
            "abilities": []
        },
        {
            "id": 60,
            "hero_name": "Lolita",
            "image": "/images/Lolita.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "115",
                "magic_power": "0",
                "armor": "27",
                "magic_resistance": "10",
                "hp": "2679",
                "mana": "480",
                "attack_speed": "0.786",
                "hp_regen_rate": "48",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Guardian's Bulwark",
                    "ability_type": "Active",
                    "ability_desc": "Lolita raises her shield to block all incoming Ranged Basic Attacks and Projectiles.\n\nUse again: Lolita launches Energy Blast, dealing 400 (+50% Total Physical ATK) to 880 (+110% Total Physical ATK) Physical Damage. The more Projectiles and Basic Attacks the shield blocks, the more damage Energy Blast will deal."
                },
                {
                    "ability_name": "Noumenon Blast",
                    "ability_type": "Active",
                    "ability_desc": "Lolita gains a shield from her Passive. Then after charging for 2s, she deals 350 (+100% Total Physical ATK) to 700 (+200% Total Physical ATK) Physical Damage in a fan-shaped area in front of her. When casting at Max Charge, Lolita will also stun her enemies for 2s (Tap again to cast immediately). When charging, Lolita slows enemies in a fan-shaped area by 75%."
                },
                {
                    "ability_name": "Charge",
                    "ability_type": "Active",
                    "ability_desc": "Lolita dashes in the designated direction. In the next 4s, her next Basic Attack will take her to the enemy target, dealing Physical Damage equal to 200 (+100% Total Physical ATK) plus 7.5% of the target's Max HP. Meanwhile, the target will be stunned for 0.8s. Deals 200 (+100% Total Physical ATK) plus 50% of target's Max HP to Minions."
                },
                {
                    "ability_name": "Noumenon Energy Core",
                    "ability_type": "Passive",
                    "ability_desc": "If Lolita takes no damage in 5s, Noumenon Energy Core will provide a shield that can take 300 (+40*Hero Level) points of damage, lasting 20s. Lolita's nearby allies can get shields while approaching her."
                }
            ]
        },
        {
            "id": 61,
            "hero_name": "Lunox",
            "image": "/images/Lunox.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "115",
                "physical_defense": "15",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2521",
                "mana": "540",
                "attack_speed": "0.808",
                "hp_regen_rate": "34",
                "mana_regen_rate": "23",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Order & Chaos",
                    "ability_type": "Active",
                    "ability_desc": "Lunox is twisted by the powers of Chaos and Order. Every time she uses her powers, they become stronger.\nWhen she uses the power of Order, she gains Brillance and deals continous damage in an invulnerable state. \nWhen she uses the power of Chaos, she gains Darkening and can blink in a designated direction, canceling the CD of Chaos Assault."
                },
                {
                    "ability_name": "Order & Chaos",
                    "ability_type": "Active",
                    "ability_desc": "Lunox is twisted by the powers of Chaos and Order. Every time she uses her powres, they come stronger.\nWhen she uses the power of Order, she gains Brillance and deals continuous damage in an invulnerable state.\n\nWhen she uses the power of Chaos, she gains Darkening and can blink in a designated direction, canceling the CD of Chaos Assault."
                },
                {
                    "ability_name": "Chaos Assault",
                    "ability_type": "Active",
                    "ability_desc": "Lunox unleashes chaos energy forward, dealing 240 (+120% Total Magic Power) points of Magic Damage and slows enemies by 10%. Lasts 1s. When attacking heroes, Lunox deals extra Magic damage equal to 2% of enemy hero's HP.\n\nGains one stack of Power of Chaos after use."
                },
                {
                    "ability_name": "Starlight Pulse",
                    "ability_type": "Active",
                    "ability_desc": "Lunox summons a rain of starlight upon nearby enemies and deals 200 (+110% Total Magic Power)  points of Magic Damage, recovering 60 (20% Total Magic Power) points of HP. The recovering effect doubles when the skill hits enemy heroes."
                },
                {
                    "ability_name": "Cosmic Fission",
                    "ability_type": "Active",
                    "ability_desc": "When Lunox uses the power of Order and Chaos, she will deal 300 (+150% Total Magic Power) points of Magic Damage to the targets along the way and slowing them by 40%. Lasts 2s."
                },
                {
                    "ability_name": "Dreamland Twist",
                    "ability_type": "Passive",
                    "ability_desc": "Lunox has lost all sense of time and reality. As a result, she does not benefit from CD reduction effects. When Darkening becomes more severe, CD effects become Magic PEN. When Brillance becomes stronger, CD effects become Physical and Magic Defense."
                }
            ]
        },
        {
            "id": 62,
            "hero_name": "Lylia",
            "image": "/images/Lylia.jpg",
            "stats": {
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Angry Gloom",
                    "ability_type": "Passive",
                    "ability_desc": "Lylia gets power from Gloom, increasing Movement Speed by 15%. Each time Gloom levels up, she will increase extra Movement Speed by 5%.\nGloom will increase his levels by devouring Shadow Energy. Up to 5. The higher level he is, the more damage he can deal."
                },
                {
                    "ability_name": "Shadow Energy",
                    "ability_type": "Active",
                    "ability_desc": "Lylia condenses Shadow Energy to the designated area, dealing 100 (+50% Total Magic Power) points of Magic Damage to enemies nearby and slowing them by 80%.\nAfter Gloom devours Shadow Energy, he will detonate the energy and deal 250 (+100% Total Magic Power) points of Magic Damage to enemies nearby. Each time Gloom upgrades himself, the damage dealt by Shadow Energy will be increased by 30%, up to 120%.\nLylia was born to have the ability to use Shadow Energy."
                },
                {
                    "ability_name": "Magic Shockwave",
                    "ability_type": "Active",
                    "ability_desc": "Lylia releases an attack wave ahead, dealing 250 (+100% Total Magic Power) points of Magic Damage to enemies on the path and slowing them by 40%. Lasts 1.5s.\nGloom will hitch a ride on her Magic Shockwave. If Gloom touches Shadow Energy, he will devour it and immediately detonate the energy."
                },
                {
                    "ability_name": "Black Shoes",
                    "ability_type": "Active",
                    "ability_desc": "Lylia immediately returns to the position where the Black Shoes was 4s ago and stacks max times up to use Shadow Energy, regenerating 10% of Max HP and increasing her Movement Speed by 20%. \nLasts 2s."
                }
            ]
        },
        {
            "id": 63,
            "hero_name": "Martis",
            "image": "/images/Martis.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "128",
                "physical_defense": "25",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2738",
                "mana": "405",
                "attack_speed": "0.868",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Decimate",
                    "ability_type": "Active",
                    "ability_desc": "Martis charges to the targeted enemy, dealing 650 (+100% Total Physical ATK) points of Physical Damage. If the target's HP is below 50%, this skill will deal True Damage. Killing a target with this skill will immediately reset its CD and increase Movement Speed by 100% for 5s (speed increased gradually decays over time)."
                },
                {
                    "ability_name": "Ashura's Wrath",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Martis uses a skill, his Attack Speed will be increased by 15%, 60% maximum. Lasts 4s."
                },
                {
                    "ability_name": "Mortal Coil",
                    "ability_type": "Active",
                    "ability_desc": "Martis stikes the enemies within the rectangle-shaped area in front of him, dealing 150 (+70% Total Physical ATK) points of Physical Damage to them and knocking them back (the direction can be changed once during the attack).\nUse Again: Martis charges forward, knocking enemies up and deal 200 (+150% Total Physical ATK) points of Physical Damage to them.\nWhile casting this skill, Martis can't be controlled and the damge taken will be reduced by 60%."
                },
                {
                    "ability_name": "Ashura Aura",
                    "ability_type": "Active",
                    "ability_desc": "Martis draws enemies to a fan-shaped area in front of him and deasl 340 (+130% Total Physical ATK) points of Physical Damage, slowing them by 40% for 2s."
                }
            ]
        },
        {
            "id": 64,
            "hero_name": "Masha",
            "image": "/images/Masha.jpg",
            "stats": {},
            "abilities": [
                {
                    "ability_name": "Life Recovery",
                    "ability_type": "Passive",
                    "ability_desc": "Masha recovers her HP to the same percentage of her last HP bar by using all her energy. If all 3 HP bars exist, she can only recover the current HP bar with full HP. Not available during the battle. She will be invincible when she casts this skill."
                },
                {
                    "ability_name": "Wild Power",
                    "ability_type": "Active",
                    "ability_desc": "Masha awakens her Wild Power, increasing her Movement Speed by 30% and dealing Physical Damage equal to 3.5% of the target's Max HP with Basic Attacks. (If the target is a creep, deals up to 350 Damage)>\n\nFor each 1s, she will lose 0.8% of her current Max HP when Wild Power is awakened. (Based on total HP of 3 HP bars)"
                },
                {
                    "ability_name": "Ancient Strength",
                    "ability_type": "Passive",
                    "ability_desc": "Masha gets Ancient Strength from Bear King and has 3 HP bars. Each time she loses 1 HP bar, she can block the damage once. She will die after she loses the last HP bar.\nEach time Masha loses 1% HP, her ATK Speed will be increased by 1.2% ( Based on total HP of 3 HP bars)\nMasha will get 10% Physical Lifesteal when she loses her first HP bar. Her Physical Lifesteal will be increased by 20%, and she will reduce 60% of the time being controlled when she loses her second HP bar."
                },
                {
                    "ability_name": "Howl Shock",
                    "ability_type": "Active",
                    "ability_desc": "Masha roars forward and unleashes an energy shock to targets, dealing 200 (+100% Total Physical ATK) points of Physical Damage and slowing them by 40%. Lasts 1s.\nIf she hits an enemy hero, she can disarm the hit hero for 2s. Picking up weapons in advance can end the disarming effect."
                },
                {
                    "ability_name": "Thunderclap",
                    "ability_type": "Active",
                    "ability_desc": "Masha launches a powerful charge after deducting 50% of her current HP. When she gets close to targets, she will release Thunderclap, dealing Physical Damage equal to 15% (+100% Total Physical ATK) of her max HP and slowing them by 90%. Lasts 0.5s."
                }
            ]
        },
        {
            "id": 65,
            "hero_name": "Minotaur",
            "image": "/images/Minotaur.jpg",
            "stats": {
                "battle_point_cost": "15000",
                "diamond_cost": "399",
                "movement_speed": "260",
                "physical_attack": "123",
                "physical_defense": "23",
                "magic_resistance": "10",
                "hp": "2759",
                "attack_speed": "0.73",
                "hp_regen_rate": "44",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Rage Mode",
                    "ability_type": "Passive",
                    "ability_desc": "Hitting enemies with Skills or Basic Attacks will recover Rage of Minotaur. Once his Rage reaches its maximum, he will enter a Rage State and gain extra Physical Attack, Physical and Magic Defense (scales with levels). And his skills will also have extra effects. After his Rage state fades, he can't recover Rage or use Minoan Fury for a brief period."
                },
                {
                    "ability_name": "Despair Stomp",
                    "ability_type": "Active",
                    "ability_desc": "Minotaur jumps towards a designated location. Upon landing, he will deal 280 (+60% Total Physical ATK) points of Physical Damage to all surrounding enemies and slow them by 65%. Lasts 2.\nMinotaur will recover Rage when he hits enemies with this skill.\n\nRage State: The attack range becomes much alrger, dealing extra Physical Damage equal to 1.5% of target's Max HP."
                },
                {
                    "ability_name": "Motivation Roar",
                    "ability_type": "Active",
                    "ability_desc": "Minotaur motivates himself and surrounding allies, regenerating 260 HP of them and enjoying an extra healing effect based on the damage he has taken. Within the next 2s, Minotaur recovers Rage when hit by Basic Attacks.\n\nRage State: Minotaur gains Rage Regen Effect within 2s, causing him to recover HP when hit by Basic Attacks."
                },
                {
                    "ability_name": "Minoan Fury",
                    "ability_type": "Active",
                    "ability_desc": "Minotaur enters a Rage-save state where he continuously recovers Rage. The longer this skill is charged, the more Rage he recovers.\n\nRage state: Minotaur smashes the ground 3 times, sending shockwaves that deal 180 (+85% Total Physical ATK) points of Physical Damage to surrounding enemies, knocking them airborne and slowing them by 70%. The final shockwave deals 200(+85% Total Physical ATK) points of True Damage."
                }
            ]
        },
        {
            "id": 66,
            "hero_name": "Minsitthar",
            "image": "/images/Minsitthar.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "121",
                "physical_defense": "23",
                "magic_power": "0",
                "magic_resistance": "10",
                "hp": "2698",
                "mana": "380",
                "attack_speed": "0.852",
                "hp_regen_rate": "37",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Spear Of Glory",
                    "ability_type": "Active",
                    "ability_desc": "Minsitthar stabs ahead with the Spear of Glory, dealing 175 (+180% Extra Physical Attack) points of Physical Damage to all enemies aong the way. When pulling back the spear, he will also pull towards himself the first enemy the spear hits, dealing 150 (+80% Extra Physical Attack) points of Physical Damage and knocks them back. Meanwhile increases 30% of Attack Speed for 2 seconds."
                },
                {
                    "ability_name": "Spear of Glory",
                    "ability_type": "Active",
                    "ability_desc": "Minsitthar stabs ahead with the Spear of Glory, dealing 175 (+180% Total Physical ATK) points of Physical Damage to all enemies along the way.\nWhen pulling back the spear, he will also pull towards himself the first enemy the spear hits, dealing 150 (+80% Total Physical ATK) points of Physical Damage and knocks the target back."
                },
                {
                    "ability_name": "All United",
                    "ability_type": "Passive",
                    "ability_desc": "Minsitthar inspires his whole team. When teammates slay enemy heroes, he obtains extra 60 gold wherever he is; whenever Minsitthar himself slays enemies, all his teammates obtain extra 15 gold."
                },
                {
                    "ability_name": "Shield Assault",
                    "ability_type": "Active",
                    "ability_desc": "Minsitthar awakens the strength of the Shield and releases the power within forward. The power explodes upon hitting the first enemy unit and deals 230 (+160% Total Physical ATK) points of Physical Damage to all enemies in the area. Meanwhile he obtains 200 (+100% Total Physical ATK) Shield and increases 20% Movement Speed immediately.\nThe first enemy will be stunned 1s and the other enemies will be knocked back."
                },
                {
                    "ability_name": "King's Calling",
                    "ability_type": "Active",
                    "ability_desc": "Minsitthar charges a short distance forward and calls 4 Royal Guards to form a field and fight together with him. Each attack of Royal Guards deals (+70% Total Physical ATK) points of Physical Damage. The Royal Guards cannot move, but they'll attack enemies in the field first. When staying in the area, Minsitthar increases 30 points of Physical and Magic Defense. Enemies in the field are slowed by 20% and cannot use directional Blink skills."
                }
            ]
        },
        {
            "id": 67,
            "hero_name": "Miya",
            "image": "/images/Miya.jpg",
            "stats": {
                "battle_point_cost": "10800",
                "hero_fragment_cost": "399",
                "movement_speed": "240",
                "physical_attack": "129",
                "magic_power": "0",
                "armor": "17",
                "magic_resistance": "10",
                "hp": "2524",
                "mana": "445",
                "attack_speed": "0.85",
                "hp_regen_rate": "30",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Turbo",
                    "ability_type": "Passive",
                    "ability_desc": "Each time Miya's Basic Atttack hits a target, her Attack Speed will be increased by 5%. Stacks up to 8 times. Lasts 4s."
                },
                {
                    "ability_name": "Fission Shot",
                    "ability_type": "Active",
                    "ability_desc": "Miya splits her Basic Attack into tw oarrows, dealing 5 (+105% Total Physical ATK) points of Physical Damage to a main target and 30% Physical Damage to others. Lasts 4s. Her Basic Attack splits only once."
                },
                {
                    "ability_name": "Turbo Stealth",
                    "ability_type": "Active",
                    "ability_desc": "Miya removes all Debuffs and conceals for 1.5s with her Movement Speed increased by 45%. Meanwhile, her Attack Speed is increased by 35% for 6s."
                },
                {
                    "ability_name": "Rains of Arrows",
                    "ability_type": "Active",
                    "ability_desc": "Miya shoots a barrage of arrows towards a designated area, dealing 5 hits of damage to enemies. Each hit deals 30(+15% Total Physical ATK) points of Physical Damage and slows enemies by 30% for 2 s.\n\nEnemies who are hit by 4 times of Rain of Arrows will be frozen for 1 s."
                }
            ]
        },
        {
            "id": 68,
            "hero_name": "Moskov",
            "image": "/images/Moskov.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "125",
                "armor": "16",
                "magic_resistance": "10",
                "hp": "2530",
                "mana": "420",
                "attack_speed": "1.1075",
                "hp_regen_rate": "32",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Spear of Quiescence",
                    "ability_type": "Passive",
                    "ability_desc": "Moskov's Basic Attack can penetrate targets and deal 80% points of Physical Damage to enemies behind him. If a Basic Attack hits a target successfully, the CD of Abyss Walker and Spear of Misery will be reduced by 1s."
                },
                {
                    "ability_name": "Abyss Walker",
                    "ability_type": "Active",
                    "ability_desc": "Moskov uses the poewr of shadow to teleport to the designated position, increasing 20% of his ATK Speed within 3s. Meanwhile, his Basic Attack deals 20% more Damage to enemies behind the target."
                },
                {
                    "ability_name": "Spear of Destruction",
                    "ability_type": "Active",
                    "ability_desc": "Moskov throws out the Spear of Destruction after charging shortly, dealing 480 (+140% Total Physical ATK) points of Physical Damage to enemies along a straight line. Each Spear hitting an enemy hero will increase 10 Physical Attack of Moskov. Stacks up to 5 times. Lasts 8s."
                },
                {
                    "ability_name": "Spear of Misery",
                    "ability_type": "Active",
                    "ability_desc": "Moskov strikes at an enemy hero with full strength, dealing 140 (+40% Total Physical ATK) Physical Damage and knocking back the target. The target's position will be exposed for 5s.\nIf the target collides with another enemy hero when knocked back, then both of them will take 210 (+60% Total Physical ATK) Physical Damage and be stunned for 1s. If the target hero knocks onto obstacles, they will be stunned for 2s."
                }
            ]
        },
        {
            "id": 69,
            "hero_name": "Nana",
            "image": "/images/Nana.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "diamond_cost": "299",
                "movement_speed": "250",
                "physical_attack": "115",
                "physical_defense": "17",
                "magic_resistance": "10",
                "hp": "2501",
                "mana": "510",
                "attack_speed": "0.86",
                "hp_regen_rate": "34",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Molina's Gift",
                    "ability_type": "Passive",
                    "ability_desc": "Molina's blessings will transform Nana for 2s when she takes a deadly damage. Within this duration, Nana is immune to all damage and her Movement Speed increases by 70%. Under the transformed state Nana recovers 10% of her Max HP but she can't use skills. The blessings activate every 120s."
                },
                {
                    "ability_name": "Magic Boomerang",
                    "ability_type": "Active",
                    "ability_desc": "Nana launches a magic boomerang in the designated direction. Each time the boomerange hits an enemy, it will deal 220 (+80% Total Magic Power) points of Magic Damage and slow enemies by 40% for 1.5s. The first enemy takes full damage, the next one takes 20% less damge, up to 60% less damage."
                },
                {
                    "ability_name": "Molina Smooch",
                    "ability_type": "Active",
                    "ability_desc": "Nana summons Molina to the designated area. After a short delay, Molina locks onto an enemy hero, chases them, and morphs them, dealing 250 (+50% Total Magic Power) points of Magic Damage and slowing them by 50% for 1.5s. Reduces Magic Defense of transformed heroes by 25%."
                },
                {
                    "ability_name": "Molina Blitz",
                    "ability_type": "Active",
                    "ability_desc": "Nana summons Molina to attack the designated area 3 times. Each attack deals 400 (+180% Total Magic Power) points of Magic Damage to enemies in the area and slows them by 50% for 2s. If Molina Blitz hits a single enemy continously, that enemy will be stunned for 1s."
                }
            ]
        },
        {
            "id": 70,
            "hero_name": "Natalia",
            "image": "/images/Natalia.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "121",
                "physical_defense": "18",
                "magic_resistance": "10",
                "hp": "2589",
                "mana": "486",
                "attack_speed": "0.902",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Assassin Instinct",
                    "ability_type": "Passive",
                    "ability_desc": "Natalia  deals extra 15% damage wehn attacking enemies from behind. \n\nIf Natalia  is in bush for 2s without taking or dealing damage, she will eneter Conceal State. 5s after leaving bush or dealing damage will make her appear. Under Conceal State, her Movement Speed is increased by 20% and her next Basic Attack will take her to the behind of enemies and deal extra 25% damage, silencing them for 1s."
                },
                {
                    "ability_name": "Claw Dash",
                    "ability_type": "Active",
                    "ability_desc": "Natalia dashes forward, dealing 250 (+50% Total Physical ATK)  points of Physical Damage to enemies along the path. This skill can be cast again within a short period of tiem after hitting an enemy."
                },
                {
                    "ability_name": "Smoke Bomb",
                    "ability_type": "Active",
                    "ability_desc": "Natalia casts a smoke bomb that lasts 4s on the current spot. In the smoke, enemies will be slowed by 55%. Meanwhile, Natalia increases her Attack Speed by 30% and becomes immune to all Basic Attacks."
                },
                {
                    "ability_name": "Cold-blooded Strangling",
                    "ability_type": "Active",
                    "ability_desc": "Natalia performs multiple attacks forward continuously, each attack dealing 150 (+70% Total Physical ATK) points of Physical Damage and slowing enemies by 40%.\nUsing Claw Dash in this duration allows Natalia to cancel the skill."
                }
            ]
        },
        {
            "id": 71,
            "hero_name": "Odette",
            "image": "/images/Odette.jpg",
            "stats": {
                "hero_fragment_cost": "120",
                "movement_speed": "240",
                "physical_attack": "105",
                "armor": "18",
                "magic_resistance": "10",
                "hp": "2491",
                "mana": "495",
                "attack_speed": "0.8",
                "hp_regen_rate": "34",
                "mana_regen_rate": "23",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Avian Authority",
                    "ability_type": "Active",
                    "ability_desc": "Odette concentrates energy to summon a swan to attack enemies, dealing 250 (+150% Total Magic Power) points of Magic Damage and slowing them by 70%. Lasts 2s."
                },
                {
                    "ability_name": "Blue Nova",
                    "ability_type": "Active",
                    "ability_desc": "Odette fires a magic energy ball forward, dealing Magic Damage to enemies and immobilizing them for 2s. After the ball has reached either its Max range or hit a target, two extra energy balls will strike out to the sides, dealing 250 (50% Total Magic Power) points of Magic Damageand immobilizing them for 2s."
                },
                {
                    "ability_name": "Swan Song",
                    "ability_type": "Active",
                    "ability_desc": "Odette gathers energy and deals Continuous Damage to enemies within the area. Deals 240 (+120% Total Magic Power) points of Magic Damage to enemies every 0.5s. Lasts 5s. The field also enhances rebounding speed and number of rebounds of Lakeshare Ambience. Reduces damage taken by 50% while active. Slows enemies by 90%, which decays over time. Lasts 2s."
                },
                {
                    "ability_name": "Lakeshore Ambience",
                    "ability_type": "Passive",
                    "ability_desc": "After casting a skill, Odette's next Basic Attack or Skill will also cast a sound wave that rebounds between enemies, dealing 144-200 (+50% Total Magic Power) points of Magic Damage."
                }
            ]
        },
        {
            "id": 72,
            "hero_name": "Pharsa",
            "image": "/images/Pharsa.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "109",
                "physical_defense": "15",
                "magic_resistance": "10",
                "hp": "2421",
                "mana": "490",
                "attack_speed": "0.79",
                "hp_regen_rate": "34",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Wings by Wings",
                    "ability_type": "Active",
                    "ability_desc": "Passive: Permanently increases 30 points of Magic Attack.\n\nActive: Pharsa turns to a mist around Verri, flying over terrain for 5s. Once controlled, this state will end immediately."
                },
                {
                    "ability_name": "Feathered Air Strike",
                    "ability_type": "Active",
                    "ability_desc": "Pharsa flies into mid-air and launches a continuous air raid on the target area in the next 13s, dealing 500 (+160% Total Magic Power) points of Magic Damage to enemies in the area."
                },
                {
                    "ability_name": "Energy Impact",
                    "ability_type": "Active",
                    "ability_desc": "Pharsa releases magic energy in the target direction, dealing 350 (+130% Total Magic Power) points of Magic Damage to the enemies hit."
                },
                {
                    "ability_name": "Spiritual Unity",
                    "ability_type": "Passive",
                    "ability_desc": "Every once in a while, Verri enters the Hunting State, during which Pharsa deals 300 (+80% Total Physical ATK) points of Physical Damage to enemies and slows them by 75% for 1.5s."
                }
            ]
        },
        {
            "id": 73,
            "hero_name": "Rafaela",
            "image": "/images/Rafaela.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "movement_speed": "245",
                "physical_attack": "117",
                "magic_power": "0",
                "armor": "15",
                "magic_resistance": "10",
                "hp": "2441",
                "mana": "545",
                "attack_speed": "0.79",
                "hp_regen_rate": "36",
                "mana_regen_rate": "23",
                "category": "Support"
            },
            "abilities": [
                {
                    "ability_name": "Holy Healing",
                    "ability_type": "Active",
                    "ability_desc": "Rafaela summons Holy Light to regenerate 370 (+50% Total Magic Power) HP for herself and the most-injured nearby ally. Regenerates 90 (+25% Total Magic Power) HP for other nearby allied heroes. Increases their Movement Speed by 50% within the following 1s."
                },
                {
                    "ability_name": "Holy Baptism",
                    "ability_type": "Active",
                    "ability_desc": "Rafaela uses the power of Holy Light to punish enemies in front of her, dealing 460 (+120% Total Magic Power) points of Magic Damage and stunning them for 1.5s, at the same time, slowing them by 40%."
                },
                {
                    "ability_name": "Light of Retribution",
                    "ability_type": "Active",
                    "ability_desc": "Rafaela uses the power of Holy Light to deal 225 (+120% Total Magic Power) points of Magic Damage to the three nearest enemies, revealing them for a short period of time and slowing them by 40% for 1.5s. If this skill hits the same target within 5s, then the damage of this skill will increase by 20%. Stacks up to 3 times."
                },
                {
                    "ability_name": "Diety Penalization",
                    "ability_type": "Passive",
                    "ability_desc": "Rafaela penalizes the target who has killed her (the target should be within a certain range). She charges for 2s and then sends the penalization power to the target, dealing True Damage equal to 20% of the target's Max HP. It can be blocked by other enemy heroes. This skill works only on enemy heroes."
                }
            ]
        },
        {
            "id": 74,
            "hero_name": "Roger",
            "image": "/images/Roger.jpg",
            "stats": {
                "battle_point_cost": "24000",
                "hero_fragment_cost": "100",
                "diamond_cost": "499",
                "movement_speed": "235",
                "physical_attack": "120",
                "armor": "22",
                "magic_resistance": "10",
                "hp": "2580",
                "mana": "450",
                "attack_speed": "0.842",
                "hp_regen_rate": "36",
                "mana_regen_rate": "15",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Hunter's Steps",
                    "ability_type": "Active",
                    "ability_desc": "Roger increases his Movement Speed by 50% for 2.5s."
                },
                {
                    "ability_name": "Wolf Transformation",
                    "ability_type": "Active",
                    "ability_desc": "Roger lunges forward and turns into a wolf, dealing 200 (+100% Total Physical ATK) points of Physical Damage and slowing enemies by 90%. Lasts 0.8s.\n\nPassive: In Wolf form, Roger increases 40 Points of Physical and Magic Defense and increases his Movement Speed by 40."
                },
                {
                    "ability_name": "Open Fire",
                    "ability_type": "Active",
                    "ability_desc": "Roger rapidly shoots twice, dealing 300 (+120% Total Physical ATK) points of Physical Damage in total.\nThe first Hunter Net slows enemies by 80%. Lasts 1.5s.\nThe second one reduces Physical Defense of enemies by 10. Lasts 5s."
                },
                {
                    "ability_name": "Full Moon Curse",
                    "ability_type": "Passive",
                    "ability_desc": "In Human form, Roger's Basic Attack slows enemies down by 20%. In wolf form, his Basic Attack deals extra damage that equals to 5% of enemies' lost HP (Up to 60 extra damage to Creeps)."
                }
            ]
        },
        {
            "id": 75,
            "hero_name": "Ruby",
            "image": "/images/Ruby.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "movement_speed": "260",
                "physical_attack": "114",
                "physical_defense": "23",
                "magic_resistance": "10",
                "hp": "2859",
                "mana": "430",
                "attack_speed": "0.858",
                "hp_regen_rate": "30",
                "mana_regen_rate": "14",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Let's Dance!",
                    "ability_type": "Passive",
                    "ability_desc": "Ruby has 5% Physical Lifesteal Effect on her own and inherits 125% Physical LIfesteal Effect from Equipment. (Her Basic Attack enjoys no lifesteal effect).\n\nAfter any skill is cast, Ruby can jump to another place, increasing 16(+1.6*Hero Level) points of Physical and Magic Defense for a short period of time. (Effect scales with levels. Stacks up to 3 times and lasts 4s."
                },
                {
                    "ability_name": "Don't Run, Wolf King!",
                    "ability_type": "Active",
                    "ability_desc": "Ruby wields her giant scythe to attack twice. Every attack deals 60 (+55% Total Physical ATK) points of Physical Damage, stunning enemies for 0.5s and slowly pulling them to her. Deals extra 20% damage to enemies in the outer ring."
                },
                {
                    "ability_name": "Be Good!",
                    "ability_type": "Active",
                    "ability_desc": "Ruby quickly slashes her scythe forward, dealing 60 (+60% Total Physical ATK) points of Physical Damage. At the same time, she casts a shockwave forward, dealing 90 (+90% Total Physical ATK) points of Physical Damage to enemies and slowing them by 40% for 2s."
                },
                {
                    "ability_name": "I'm Offended!",
                    "ability_type": "Active",
                    "ability_desc": "Ruby uses the scythe to attack in a wide range, dealing 205 (+180% Total Physical ATK) points of Physical Damage to enemies, pulling them to her and stunning them for 0.5s."
                }
            ]
        },
        {
            "id": 76,
            "hero_name": "Saber",
            "image": "/images/Saber.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "diamond_cost": "299",
                "movement_speed": "260",
                "physical_attack": "118",
                "physical_defense": "17",
                "magic_resistance": "10",
                "hp": "2599",
                "mana": "443",
                "attack_speed": "0.87",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Charge",
                    "ability_type": "Active",
                    "ability_desc": "Saber charges towards a designated place, dealing 80 (+40% Total Physical ATK) points of Physical Damage to enemies along the way."
                },
                {
                    "ability_name": "Triple Sweep",
                    "ability_type": "Active",
                    "ability_desc": "Saber attacks an enemy hero, knocking the target into the air for 1.2s, and then dealing 3 blows continuously. Each blow deals 200 (+130% Total Physical ATK) points of Physical Damage."
                },
                {
                    "ability_name": "Enemy's Bane",
                    "ability_type": "Passive",
                    "ability_desc": "Saber's damage reduces Physical Defense of enemies by 7 points. Stacks up to 5 times. Lasts 5s."
                },
                {
                    "ability_name": "Flying Sword",
                    "ability_type": "Active",
                    "ability_desc": "Saber shoots out 4 flying swords, with each sword dealing up to 160 (+90% Extra Total Physical ATK) points of Physical Damage. Swords will spin around for awhile and then fly back to Saber.\n\nUsing Charge will call the swords back earlier. Swords also deal damage if they hit an enemy on their way back. This skill enjoys only 40% of Spell Vamp."
                }
            ]
        },
        {
            "id": 77,
            "hero_name": "Selena",
            "image": "/images/Selena.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "110",
                "magic_resistance": "10",
                "hp": "2401",
                "mana": "490",
                "attack_speed": "0.804",
                "hp_regen_rate": "34",
                "mana_regen_rate": "18",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Symbiosis",
                    "ability_type": "Passive",
                    "ability_desc": "Selena can switch freely between her two forms.\nEleven Form:When using skills in her Eleven form Selena attaches Abyssal Mark. Stacks up to 2 times.When Abyssal TRap hits an enemy, it immediately adds an Abyssal Mark.\nAbyssal Form: All damage will consume 1 of Abyssal Mark to deal 240-450 (+40% Total Magic Power) points of Magic Damage."
                },
                {
                    "ability_name": "Abyssal Arrow",
                    "ability_type": "Active",
                    "ability_desc": "Selena fires magic arrows in a designated direction. The enemy hero hit first takes 250 (+20% Total Magic Power) to 500 (+% Total Magic Power) points of Magic Damage and will be stunned for 0.5s-3s. Stun duration and damage increase with distance the arrows fly. \nThe arrow absorbs Abyssal Traps as it travels to the target enemy, effects of Abysssal Traps will be inflicted to target enemy upon hit. If stunned an enemy for 1s or longer, Selena's Movement Speed will be increased by 40%. Lasts 2s."
                },
                {
                    "ability_name": "Abyssal Trap",
                    "ability_type": "Active",
                    "ability_desc": "Selena summons an Abyssal Devil to lurk in a designated location. The Abyssal Devil smothers a nearby enemy with its body. The enemy's Movement Speed is reduced by 70%. After 1s, this skill deals 400 (+150% Total Magic Power) points of Magic Damage to the target and other nearby enemies, slows enemies for 1s by 50%. \nSelena can summon tp to 3 Abyssal Devils. For each Abyssal Devil, the final extra damage will increase by 50%."
                },
                {
                    "ability_name": "Primal Darkness",
                    "ability_type": "Active",
                    "ability_desc": "Selena enters Abyssal Form and increases her Movement Speed by 30%. Lasts 0.8s. Immediately reset the CD of Soul Eater Garotte. \nAbyssal Form: Gain new skills. Her Basic Attack will deal extra (+25% Total Magic Power) points of Magic Damage."
                }
            ]
        },
        {
            "id": 78,
            "hero_name": "Silvanna",
            "image": "/images/Silvanna.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "126",
                "physical_defense": "22",
                "magic_resistance": "10",
                "hp": "2828",
                "mana": "430",
                "attack_speed": "0.92",
                "hp_regen_rate": "39",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": []
        },
        {
            "id": 79,
            "hero_name": "Sun",
            "image": "/images/Sun.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "114",
                "armor": "23",
                "magic_resistance": "10",
                "hp": "2758",
                "mana": "400",
                "attack_speed": "0.916",
                "hp_regen_rate": "41",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Endless VAriety",
                    "ability_type": "Active",
                    "ability_desc": "Sun hurls his Golden Staff towards a designated direction, dealing 250 (+70% Total Physical ATK) points of Physical Damage to enemies along its path. Heros and creeps that touch the Staff will be slowed for 2s. At that point, Sun will create a Doppleganger to attack the enemies. Dopplegangers enjoy 35% of Sun's attributes and last for 5s."
                },
                {
                    "ability_name": "Instantenous Move",
                    "ability_type": "Active",
                    "ability_desc": "Sun and his Dopplegangers launch an instantenous attack against a designated enemy, dealing 180 (+60% Total Physical ATK) points of Physical Damage. Within 2.5s of casting this skill, Sun and his dopplegangers enjoy a 30% increase in Movement Speed."
                },
                {
                    "ability_name": "Clone Techniques",
                    "ability_type": "Active",
                    "ability_desc": "Sun summons a Doppleganger that has 70% of his attributes. Dopplegangers take more damage, while each of their attacks recover Sun's HP by (+80% Total Physical ATK) points. Dopplegangers lasts 12s."
                },
                {
                    "ability_name": "Simian God",
                    "ability_type": "Passive",
                    "ability_desc": "Physical Defense of enemies will be reduced by 6% when they take damage from Sun or his Dopplegangers. Stacks up to 10 times."
                }
            ]
        },
        {
            "id": 80,
            "hero_name": "Terizla",
            "image": "/images/Terizla.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "129",
                "physical_defense": "19",
                "magic_resistance": "10",
                "hp": "2728",
                "attack_speed": "0.82",
                "hp_regen_rate": "54",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Revenge Strike",
                    "ability_type": "Active",
                    "ability_desc": "Terizla cracks the ground with his hammer and the fissure will spread out, dealing 300 (+80% Total Physical ATK) points of Physical Damage. Afte the fissure hits the first target, it will drill into the target and slow them by 30%. At the same time, Terizla's Movement Speed will be increased by 25%. Lasts 3s. The fissure on target will then explode, dealing 300 (+80% Total Physical ATK) and 20% points of Physical Damage of that enemy's lost HP."
                },
                {
                    "ability_name": "Body of Smith",
                    "ability_type": "Passive",
                    "ability_desc": "Every 2% of Terizla's HP lost will be converted to 1% Damage Reduction (up to 40%).\nTerizla's Attack Speed can not be increased. Per 1% extra Attack Speed will be transformed into 1 point of Physical Attack."
                },
                {
                    "ability_name": "Penalty Zone",
                    "ability_type": "Active",
                    "ability_desc": "Terizla jumps to the designated area to smash down, causing 300 (+100% Total Physical ATK) points of Physical Damage and slowing enemies down by 55%. MEanwhile, he summons Scaffold, which will reach out a hook to the enemies and pull the target several times, causing 150 (+30% Total Physical ATK) points of Physical Damage each time."
                },
                {
                    "ability_name": "Execution Strike",
                    "ability_type": "Active",
                    "ability_desc": "Terizla swings the hammer in sector area and releases his energy for 3 times continuously (Move the joystick to change the position while swinging). The first 2 times he will deal 180 (+150% Total Physical ATK) points of Physical Damage to enemies. The 3rd time he will deal 225 (+300% Total Physical ATK) points of Physical Damage to enemies and slow them by 15%. This slow effect can be stacked. Lasts 1.5s."
                }
            ]
        },
        {
            "id": 81,
            "hero_name": "Thamuz",
            "image": "/images/Thamuz.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "255",
                "physical_attack": "123",
                "physical_defense": "24",
                "magic_resistance": "10",
                "hp": "2758",
                "attack_speed": "0.86",
                "hp_regen_rate": "39",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Slaughterous Scythes",
                    "ability_type": "Active",
                    "ability_desc": "Thamuz tosses a pair of scythes to a designated direction. After travelling for a certain distance or hitting the first enemy hero, they deal 160 (+100% Total Physical Attack) points of Physical Damage. The scythes will then slow the enemies nearby 40% for a period of time, and deal 60 points of Physical Damage in every 0.5s. After a while, the scythes return to Thamuz, pulling enemies on the path. Thamuz can retrieve the scythes to reduce the next CD."
                },
                {
                    "ability_name": "Chasm Leap",
                    "ability_type": "Active",
                    "ability_desc": "Thamuz jumps to a designated area to deal 250 (+80% Extra Physical Attack) points of Physical Damage and slow the enemy in 2s when landing. If the scythes are still travelling they will return to Thamuz."
                },
                {
                    "ability_name": "Molten Scythes",
                    "ability_type": "Active",
                    "ability_desc": "Thamuz tosses Scythe to a designated direction. After traveling for a certain distance or hitting the first enemy hero, they deal 150 (+60% Total Physical ATK) points of Physical Damage. The Scythe will then slow nearby enemies by 30% for a period of time, and deal 45 (+20% Total Physical ATK) points of Physical Damage in every 0.5s. \nAfter leaving Thamuz for a period of time or a certain distance, the Scythe will return to Thamuz.\nThamuz can approach the scythes to retrieve them."
                },
                {
                    "ability_name": "Chasm Trample",
                    "ability_type": "Active",
                    "ability_desc": "Thamuz jumps to a designated area to deal 230 (+60% Total Physical ATK) points of Physical Damage and slow the enemy units by 25% when landing. Lasts 2s.\nIf the scythes are still travelling, they will return to Thamuz and Molten Scythes will reset its CD instantly."
                },
                {
                    "ability_name": "Cauterant Inferno",
                    "ability_type": "Active",
                    "ability_desc": "Thamuz spouts the lava stored within his body to deal 300 (+80% Total Physical ATK) points of Physical Damage to enemies in nearby area and creates a cauterant atmosphere around him. The atmosphere lasts 9s and deals 20 (+5% Total Physical ATK) points of Physical Damage every 0.5s. Thamuz recovers 3% HP when dealing damage with Basic Attack or scyhres when this skill is active. He gains an extra 22% Attack Speed when using Cauterant Inferno."
                },
                {
                    "ability_name": "Grand Lord Lava",
                    "ability_type": "Passive",
                    "ability_desc": "Thamuz inflicts a Scorch Effect when dealing damage to enemies, which deals 12 (+5% Total Physical ATK) points of Physical Damage to enemies continuously. This effect can be stacked. Also, Thamuz moves 3 faster when he's not carrying his Scythe. Increases his own Movement Speed by 25% without Scythe. Retrieving the Scythe will strengthen his next Basic Attack to deal 100% points of damage, slowing targets by 30%, and generates a gush of lava beneath the target. This lava explodes in 2s, dealing 50 (+110% Total Physical ATK) points of True Damage."
                }
            ]
        },
        {
            "id": 82,
            "hero_name": "Tigreal",
            "image": "/images/Tigreal.jpg",
            "stats": {
                "battle_point_cost": "6500",
                "movement_speed": "260",
                "physical_attack": "112",
                "armor": "25",
                "magic_resistance": "10",
                "hp": "2890",
                "mana": "450",
                "attack_speed": "0.826",
                "hp_regen_rate": "42",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Fearless",
                    "ability_type": "Passive",
                    "ability_desc": "Tigreal gains a layer of blessing when using skills or being hit by Basic Attacks (Those from minions are excluded). He gains immunity to the next Basic Attack after gaining 4 layers in total (Those from minions are excluded)."
                },
                {
                    "ability_name": "Attack Wave",
                    "ability_type": "Active",
                    "ability_desc": "Tigreal fires an attack wave in a designated direction, dealing 300 (+80% Total Physical ATK) points of Physical Damage to enemies and slowing them by 40% for 2s."
                },
                {
                    "ability_name": "Implosion",
                    "ability_type": "Active",
                    "ability_desc": "Tigreal thrusts his sword into the earth, pulling surrounding enemies to himself. Then he deals 270 (+130% Total Physical ATK) points of Physical Damage to them and stuns them for 1.5s. (This skill can be interrupted by transformation and airborne effects.)"
                },
                {
                    "ability_name": "Sacred Hammer",
                    "ability_type": "Active",
                    "ability_desc": "Tigreal charges in a specified direction and collides with enemies, dealing (+100% Total Physical ATK) points of Physical Damage.\n\n4s after the charge, Tigreal can use the skill again to launche a second attack, dealing 180 (+60% Total Physical ATK) points of Physical Damage and knocking enemies into the air for 1s."
                }
            ]
        },
        {
            "id": 83,
            "hero_name": "Uranus",
            "image": "/images/Uranus.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "115",
                "armor": "20",
                "magic_resistance": "10",
                "hp": "2689",
                "mana": "455",
                "attack_speed": "0.834",
                "hp_regen_rate": "32",
                "mana_regen_rate": "12",
                "category": "Tank"
            },
            "abilities": [
                {
                    "ability_name": "Ionic Edge",
                    "ability_type": "Active",
                    "ability_desc": "Uranus releases two energy spheres that orbit around him, dealing 125 (+30% Total Magic Power) points of Magic Damage to enemy targets, while reducing their Physical Attack and Magic power by 15%, and thier Movement Speed by 30% for 2s.\nEach time this skill deals damage to a target, the target will receive a stack of mark. Each stack increases the damage of this skill by 40%, 320% maximum. Each energy sphere only deals damage to the same target once."
                },
                {
                    "ability_name": "Radiance",
                    "ability_type": "Passive",
                    "ability_desc": "Uranus absorbs the energy generated by attacks made against him to strengthen himself, regenerating 2-10 HP per second for each stack, over 10 seconds. This effect can be stacked up to 20 times."
                },
                {
                    "ability_name": "Transcendent Ward",
                    "ability_type": "Active",
                    "ability_desc": "Uranus charges towards the targeted direction, dealing 80 (+20% Total Magic Power) points of Magic Damage to enemies along the way, dealing 160 (+80% Total Magic Power) points of Magic Damage to enemies in this location and slowing them down by 25%. Meanwhile, Uranus generates an energy shield that absorbs up to 400 (+200% Total Magic Power) damage for 4s.\nThe shield explodes whne broken or at the end of its duration, dealing 300 (+150% Total Magic Power) points of Magic Damageto enemies nearby."
                },
                {
                    "ability_name": "Consecration",
                    "ability_type": "Active",
                    "ability_desc": "Uranus unleashes energy stored within his body to remove the Slow Effect on himself and restore 200 points of HP immediately, while increases Movement Speed by 60% for 8s. (The speed gained decays over time).\nUranus directly acquires 5 stacks of Radiance, increasing 50% of the shield and Regen received by 8s, during which he can't be controlled."
                }
            ]
        },
        {
            "id": 84,
            "hero_name": "Vale",
            "image": "/images/Vale.jpg",
            "stats": {
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Windstorm",
                    "ability_type": "Active",
                    "ability_desc": "Vale summons a windstorm in a designated area. After 1.5s, the windstorm will explode, dealing 800 (+160% Total Magic Power) points of Magic Damage to enemies in the area.\nWhen leveling up, Vale can choose Damage Increase or Crowd Control to this skill."
                },
                {
                    "ability_name": "Windtalk",
                    "ability_type": "Passive",
                    "ability_desc": "When reaches lv. 4/6/8, he can enhance one of his skills and each skill can be enhanced once only. It can be chosen by players.\n\nVale gains a stack of Windtalk each time he kills or assists to kill an enemy. Each stack will increase 5 points of Movement Speed. Stacks up to 12 times."
                },
                {
                    "ability_name": "Windblow",
                    "ability_type": "Active",
                    "ability_desc": "Vale sends a whirlwind forward. Deals 410 (+120% Total Magic Power) points of Magic Damage and slows enemies by 30% when the whirlwind hits an enemy unit. Lasts 2s.\nWhen leveling up, Vale can choose to add Stop-on-Hit Effect or Knock-Airborne Effect to this skill."
                },
                {
                    "ability_name": "Wind Blade",
                    "ability_type": "Active",
                    "ability_desc": "Vale unleashes two wind blades towards the left and right of a designated area. Wind blades deals 230 (+80% Total Magic Power) points of Magic Damage.\nWhen leveling up, Vale can choose to Damge Range Increase or Damage Increase to this skill."
                }
            ]
        },
        {
            "id": 85,
            "hero_name": "Valir",
            "image": "/images/Valir.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "245",
                "physical_attack": "105",
                "armor": "18",
                "magic_resistance": "10",
                "hp": "2516",
                "mana": "495",
                "attack_speed": "0.8",
                "hp_regen_rate": "34",
                "mana_regen_rate": "18",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Burst Fireball",
                    "ability_type": "Active",
                    "ability_desc": "Valir casts a fireball in a designated direction. The fireball will explode upon hitting an enemy target, dealing 280 (+80% Total Magic Power) Magic Damage to enemies within the explosion range and slowing them by 40% for 1. Meanwhile, it ignites the ground along the way, which leads to an explosion after several seconds, dealing 140 (+40% Total Magic Power) Magic Damge to enemies within the area of effect.\nValir can stack the fireball up to 2 times. If the first target the fireball hits is an enemy hero, Valir will restoer a fireball at once."
                },
                {
                    "ability_name": "Ashing",
                    "ability_type": "Passive",
                    "ability_desc": "Valir's skills ignite his targets ablaze, every second dealing Magic Damage equal to 0.6% of their Max HP. Lasts for 4s.\nWhen blaze stacks 3 times on a target, it causes an explosion dealing Magic Damage equal to 8% of target's Max HP and stunning the target for 1s. (Within 7s, the same target can only be stunned by Valir's skills once.)"
                },
                {
                    "ability_name": "Vengeance Flame",
                    "ability_type": "Active",
                    "ability_desc": "Valir removes all CC effects from him and surrounds himself with 4 Vengeance Flames, enhancing his Burst Fireball/Searing Torrent. This enhancement increases the skill damage by 30% for 9s. Meanwhile, increases his Movement Speed (decays with time) by 60% in 5s."
                },
                {
                    "ability_name": "Searing Torrent",
                    "ability_type": "Active",
                    "ability_desc": "Valir unleashes a torrent of flames forward, knocking enemies back to the very end of its range and dealing 200 (+60% Total Magic Power) points of Magic Damage to them.\nAfter being enhanced by the Vengance Flame, the Searing Torrent will generate a fireball at the very end of its range that lasts 4s, dealing 100(+30% Total Magic Power) Magic Damage to nearby enemies each second.\nThe torrents of flames and fireall can slow enemies by 25% for 1s."
                }
            ]
        },
        {
            "id": 86,
            "hero_name": "Vexana",
            "image": "/images/Vexana.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "245",
                "physical_attack": "112",
                "physical_defense": "17",
                "magic_resistance": "10",
                "hp": "2421",
                "mana": "490",
                "attack_speed": "1",
                "hp_regen_rate": "38",
                "mana_regen_rate": "20",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Necromancy Spell",
                    "ability_type": "Passive",
                    "ability_desc": "Vexana adds Necromancer to targets who take damage from her. Lassts 5s. While the spell lasts, the target will explode upon death, dealing 220-500 (+50% Total Magic Power) points of Magic Damage to surrounding units (Basic Damage increases with level).\n\nVexana summons puppets to attack enemies and will also add Necromancer on them."
                },
                {
                    "ability_name": "Charmed Specter",
                    "ability_type": "Active",
                    "ability_desc": "Vexana unleashes phantom power forward, dealing 250 (+60% Total Magic Power) points of Magic Damage and fearing enemy heroes. Lasts 1s."
                },
                {
                    "ability_name": "Cursed Oath",
                    "ability_type": "Active",
                    "ability_desc": "Vexana puts a curse on an enemy hero, dealing 250 (+80% Total Magic Power) points of Magic Damage. Curses the target continuously within 8s and deals 75 (+20% Total Magic Power) points of Magic Damage (It can't be Purified).\nIf a target dies while under the curse or the cur's duration comes to an end, Vexana will summon a puppet in the form of the target, which will follow her into battle. Puppets inherit 70% of the target's attributes, continously deal 5% of the puppet's Max HP as Magic Damage to surrounding enemies. Puppet lasts 20s."
                },
                {
                    "ability_name": "Nether Snare",
                    "ability_type": "Active",
                    "ability_desc": "Vexana summons a curse power to deal 500 (+200% Total Magic Power) points of Magic Damage to a specified location."
                }
            ]
        },
        {
            "id": 87,
            "hero_name": "WanWan",
            "image": "/images/WanWan.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "100",
                "hp": "2540",
                "mana": "424",
                "attack_speed": "0.83",
                "hp_regen_rate": "2540",
                "mana_regen_rate": "14",
                "category": "Assassin"
            },
            "abilities": [
                {
                    "ability_name": "Tiger Pace",
                    "ability_type": "",
                    "ability_desc": "Wanwan reveals the Vital of enemy Heroes hit by her hidden weapons. If she hits all vitals of the target, she will be able to deal 25% damage to the target.  Wanwan can move a short distance when she throws a Sleeve Dart. The speed of this movement scales with the attack speed."
                },
                {
                    "ability_name": "Swallows Path",
                    "ability_type": "",
                    "ability_desc": "Wanwan throws a Swallow Dart in a designated direction, dealing 150 / 180 / 210 / 240 / 270 / 300 (+60% Total Physical Attack) Physical Damage to enemies along the path and triggering Tiger Pace. The Swallow Dart will transform into a Zone of Swallow Daggers at its destination. Lasts 5s.  Use Again: A Swallow Dagger returns to Wanwan, dealing 60 / 72 / 84 / 96 / 108 / 120 (+80% Total Physical Attack) Physical Damage to enemies along the way and reducing their Movement Speed by 60% for 0.5s. Wanwan can restore up to 3 Swallow Dagger(s) from the Zone."
                },
                {
                    "ability_name": "Needles In Flower",
                    "ability_type": "",
                    "ability_desc": "Wanwan removes all CC from herself immediately and loses deadly throwing needles, dealing 200 / 220 / 240 / 260 / 280 / 300 (+60% Total Physical Attack) Physical Damage to nearby enemies and reducing their Movement Speed by 40% for 1s."
                },
                {
                    "ability_name": "Crossbow Of Tan",
                    "ability_type": "",
                    "ability_desc": "Wanwan activates her crossbow and shoots arrows to enemies whose Vitals are all hit by her for 10 time(s). (Will shot 1 more time for every 40% extra Attack Speed). Each arrow deals 60 / 72 / 84 (+50% Total Physical Attack) Physical Damage and the last arrow will deal Crit Damage and trigger Tiger Pace. Crossbow of Tang can only be cast to enemies whose all vitals are hit."
                }
            ]
        },
        {
            "id": 88,
            "hero_name": "X Borg",
            "image": "/images/X_Borg.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "260",
                "physical_attack": "117",
                "hp": "1018",
                "mana": "0",
                "attack_speed": "0.868",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Fire Missiles",
                    "ability_type": "Active",
                    "ability_desc": "X. Borg activates the flamethrower and fires in the chosen direction, dealing Damage continuously. Enemies whose tempeture rises to the limit will take True Damage.  Armorless State: X.Borg adjusts the flamethrower to narrow the gunfire coverage and extend the shooting range, reducing the damage of that in Armor State."
                },
                {
                    "ability_name": "Fire Missles",
                    "ability_type": "Active",
                    "ability_desc": "X.Borg activates the flamethrower and fires in the designated direction, dealing 40 (+50% Total Physical ATK) points of Physical Damage for 2s. Enemies whose temperature rises to the limit will take True Damage and slow down by20%.\nArmorless State: X.Borg adjusts the flamethrower to narrow angle and lengthen distance, reducing the damage to 60% of that in Armor State."
                },
                {
                    "ability_name": "Fire Stake",
                    "ability_type": "Active",
                    "ability_desc": "X.Borg shoots 6 Fire Stakes at the edge of the fan-shaped indictator. 1.2s later, the stakes are taken back into his body. Each stake deals 50 (+20% Total Physical ATK)Physical Damage to enemies in the path and pulls them back. If the Fire Stake touches the Firaga supplies in its path, it will take them back as well.\nArmorless State: X.Borg adjusts the Fire Stake Launcher to send the stakes farther away and shortens the gap between the stakes."
                },
                {
                    "ability_name": "Firaga Armor",
                    "ability_type": "Passive",
                    "ability_desc": "X.Borg's Firaga Armor inherits 30% of his Max HP and takes all damage for X.Borg while it's active. When the Armor runs out of HP, X.Borg will do a roll to the direction of the Left Joystick to disengage from the Armor. X.Borg won't take any damage in this duration. He then continues to restore energy in Armorless State. When energy is full, X.Borg will re-equip the Armor and restore the Armor to 30% of his Max HP.\nX.Borg's fire damage causes enemies to arm up, and enemies with highest tmperature will drop Firaga supplies when they take flame damage. Pick up supplies and restore Armor, ore restore energy while in Armorless State."
                },
                {
                    "ability_name": "Last Insanity",
                    "ability_type": "Active",
                    "ability_desc": "X.Borg charges forward in a designated direction, shooting fire around to deal 200 (+100% Total Physical ATK) points of Physical Damage and slowing enemies by 25%. If he hits an enemy hero during the charge, he will stop charging and slow the target by extra 40%. The whole process lasts 3s. Then he self-explodes to cause 400 and 15% of True Damage of target's Max HP. The explosion destroys the current Firaga Armor and deals 50% damag and puts himself under the Armorless State, where this skill cannot be used.\nHe can move again according to the direction of Joystick after he self-explodes.\nUse Again: End the falme spray and self-explode right away."
                }
            ]
        },
        {
            "id": 89,
            "hero_name": "Yi Sun-Shin",
            "image": "/images/Yi_Sun-Shin.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "hero_fragment_cost": "120",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "110",
                "armor": "18",
                "hp": "2520",
                "attack_speed": "1.075",
                "hp_regen_rate": "36",
                "mana_regen_rate": "15",
                "category": "Marksman"
            },
            "abilities": [
                {
                    "ability_name": "Mountain Shocker",
                    "ability_type": "Active",
                    "ability_desc": "Yi Sun-shin summons the naval fleet to launch 3 waves of rocket attacks. Each wave deals 165 (35% Total Physical ATK) points of Physical Damage and will also slow enemies slightly."
                },
                {
                    "ability_name": "Heavenly Vow",
                    "ability_type": "Passive",
                    "ability_desc": "Yi Sun-shin chooses his longbow or glaive to attack according to his distance from his enemies. Using the glaive to attack will deal more damage and reduce the CD of One-wave Sweep by 1s.\n\nA navy fleet will be summoned at the allied Base to strengthen it. Yi Sun-shin can board the Turtle Ship beside the base periodically and get buffs."
                },
                {
                    "ability_name": "Blood Floods",
                    "ability_type": "Active",
                    "ability_desc": "Yi Sun-shin shoots a piercing arrow at full strength, dealing 160 (+100% Total Physical ATK) points of Physical Damage to enemies as well as slowing them by 40%. Lasts 2s.\nThe arrow's attack range and damage scale with charge time. The first enemy takes full damage, the next one takes 20% less (up to 60% less damage). When charging, his Movement Speed will be reduced slightly."
                },
                {
                    "ability_name": "One-wave Sweep",
                    "ability_type": "Active",
                    "ability_desc": "With glaive in hand, Yi Sun-shin slashes forward, dealing 160 (+100% Total Physical ATK) points of Physical Damage to enemies along the way and slowing them by 30% for 2s.\n\nWhen Yi Sun-shin is on his Turtle Ship, the ship will dash in the designated direction, dealing 200 (+100% Total Physical ATK) points of Physical Damage to the first enemy it collides with and enemies nearby, stunning them for 1.5s."
                }
            ]
        },
        {
            "id": 90,
            "hero_name": "Zhask",
            "image": "/images/Zhask.jpg",
            "stats": {
                "battle_point_cost": "32000",
                "diamond_cost": "599",
                "movement_speed": "240",
                "physical_attack": "107",
                "physical_defense": "15",
                "magic_resistance": "10",
                "hp": "2401",
                "mana": "490",
                "attack_speed": "0.8",
                "hp_regen_rate": "34",
                "mana_regen_rate": "20",
                "category": "Mage"
            },
            "abilities": [
                {
                    "ability_name": "Decimation",
                    "ability_type": "Passive",
                    "ability_desc": "Upon death, Zhask commands a Nightmaric Spawn, to self-explode with him, dealing 500 (+100% Total Magic Power) points of True Damage to enemies nearby."
                },
                {
                    "ability_name": "Mind Eater",
                    "ability_type": "Active",
                    "ability_desc": "Zhask fires penetrating mental missle in the designated direction, dealing 370 (+100% Total Magic Power) points of Magic Damage to enemies along the way, after which Nightmaric Spawn will cast Mind Eater once. IF both of them hit the same target, then the target will be stunned for 0.5s.\n\nFusion Enhanced: The damage of Zhask and Nightmaric Spawn is fused together, dealing 640 (+180% Total Magic Power) points of Magic Damage."
                },
                {
                    "ability_name": "Dominator's Descent",
                    "ability_type": "Active",
                    "ability_desc": "Zhask substantially enhances the power of Nightmeric Spawn, increasing all its attributes. The enhance increases as skill levels up. \n\nUse Again: Zhask immediately gets off Nightmeric Spawn and loses enhancement."
                },
                {
                    "ability_name": "Nightmaric Spawn",
                    "ability_type": "Active",
                    "ability_desc": "Zhask summons a Nightmaric Spawn, in the designated location. Nightmaric Spawn cannot move but will automatically attack nearby enemies. Every 2 Basic Attacks launch Death Ray at a target, slowing those who are hit continuously for a short time.\nNightmaric Spawn will enjoy 70% of Zhask's attributes. If Zhask is too far away from Nightmaric Spawn, it will disappear."
                },
                {
                    "ability_name": "Hive Clones",
                    "ability_type": "Active",
                    "ability_desc": "Zhask releases a swarm of Nightmeric Clones in the targeted direction. The clones will explode and deal 140 (+50% Total Magic Power) points of Magic Damage to enemies on contact, reducing their Movement Speed by 80%. Lasts 1s.\n\nIf Nightmeric Clones find no target, they will burrow into the ground and ambush enemies passing by.\n\nFusion Enhanced: Zhask releases several swarms of Nightmeric Clones"
                }
            ]
        },
        {
            "id": 91,
            "hero_name": "Zilong",
            "image": "/images/Zilong.jpg",
            "stats": {
                "battle_point_cost": "0",
                "diamond_cost": "0",
                "movement_speed": "265",
                "physical_attack": "123",
                "physical_defense": "25",
                "magic_resistance": "10",
                "hp": "2689",
                "mana": "405",
                "attack_speed": "0.964",
                "hp_regen_rate": "35",
                "mana_regen_rate": "16",
                "category": "Fighter"
            },
            "abilities": [
                {
                    "ability_name": "Dragon Flurry",
                    "ability_type": "Passive",
                    "ability_desc": "Every 6s, Zilong's next Basic Attack will land a combo on the target in front of him for multiple times, dealing a total of 1.8x Basic Attack damage. Hitting enemies with a Basic Attack will reduce the CD of Passive by 0.5s."
                },
                {
                    "ability_name": "Spear Strike",
                    "ability_type": "Active",
                    "ability_desc": "Zilong dashes toward the target, dealing 260 (+30% Total Physical ATK) points of Physical Damage. Then he performs a quick Basic Attack immediately."
                },
                {
                    "ability_name": "Spear Flip",
                    "ability_type": "Passive",
                    "ability_desc": "Zilong lifts an enemy over his back, dealing 300 (+140% Total Physical ATK) Physical Damage and reducing the target's Physical Defense by 10 for 2s."
                },
                {
                    "ability_name": "Supreme Warrior",
                    "ability_type": "Active",
                    "ability_desc": "Zilong increases his Movement Speed by 30% and Attack Speed by 45%, becoming immune to Slowing Effect for 6s. Removes Debuffs upon casting."
                }
            ]
        }
    ]
}